#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x98 (0xC0 - 0x28)
// Class FortniteGame.AIHotSpotSlot
class UAIHotSpotSlot : public UObject
{
public:
	uint8                                        Pad_66[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LocalTransform;                                    // 0x30(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        Height;                                            // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Radius;                                            // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceToFocusActor;                              // 0x68(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        UserId;                                            // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartEnabled : 1;                                 // Mask: 0x1, PropSize: 0x10x70(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasCachedAgentData : 1;                           // Mask: 0x2, PropSize: 0x10x70(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasOverlappingSlots : 1;                          // Mask: 0x4, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDistanceToFocusActor : 1;                      // Mask: 0x8, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsBlockingOthers : 1;                             // Mask: 0x10, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x20, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_0 : 2;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6B[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AAIController*                         Owner;                                             // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x80(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAIHotSpotSlot                    SlotState;                                         // 0x84(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6C[0x3B];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotSlot* GetDefaultObj();

	void SetSlotState(enum class EAIHotSpotSlot NewState);
	void SetSlotOwnerAndState(class AAIController* NewOwner, enum class EAIHotSpotSlot NewState);
	void SetSlotEnabled(bool bNewEnabled);
	void OnStateChanged(class AAIController* SlotOwner, enum class EAIHotSpotSlot NewState);
	bool IsEnabled();
	bool IsAIAllowed(class AAIController* AI);
	bool HasUserId();
	int32 GetSlotUserId();
	enum class EAIHotSpotSlot GetSlotState();
	struct FRotator GetSlotRotation();
	float GetSlotRadius();
	class AAIController* GetSlotOwner();
	struct FVector GetSlotLocation();
	int32 GetSlotIndex();
	float GetSlotHeight();
	struct FBox GetSlotBounds();
	class AAIHotSpot* GetHotSpot();
	void ClearSlot();
};

// 0x188 (0x510 - 0x388)
// Class FortniteGame.AIHotSpot
class AAIHotSpot : public AActor
{
public:
	uint8                                        Pad_85[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAIHotSpotSlot*>                UserSlots;                                         // 0x390(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotSlotGenerator*               SlotGenerator;                                     // 0x3A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAIHotSpotSlot*>                Slots;                                             // 0x3A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	class AActor*                                FocusActor;                                        // 0x3B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x3C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CustomNavmeshSearchExtent;                         // 0x3C8(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartEnabled : 1;                                 // Mask: 0x1, PropSize: 0x10x3D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowSlotlessAssignment : 1;                      // Mask: 0x2, PropSize: 0x10x3D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowClaimingMultipleSlots : 1;                   // Mask: 0x4, PropSize: 0x10x3D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTrackOverlappingSlots : 1;                        // Mask: 0x8, PropSize: 0x10x3D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bProjectSlotsOnNavmesh : 1;                        // Mask: 0x10, PropSize: 0x10x3D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCustomNavmeshSearchExtent : 1;                    // Mask: 0x20, PropSize: 0x10x3D4(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x40, PropSize: 0x10x3D4(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_1 : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_86[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AAIController*>                 NoSlotAssignees;                                   // 0x3D8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_87[0x110];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   RenderingComponent;                                // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                   SpriteComponent;                                   // 0x500(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_88[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAIHotSpot* GetDefaultObj();

	void SetEnabled(bool bEnabled);
	int32 RemoveGroupFromHotspot(const TArray<class AAIController*>& GroupOfAI);
	bool RemoveFromHotspot(class AAIController* AI, bool bAssignFromWaitingList);
	void OnSlotOccupied(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotFreed(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotEnabled(int32 Index, int32 UserId);
	void OnSlotDisabled(int32 Index, int32 UserId);
	void OnSlotClaimed(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotBlocked(class AAIController* AI, int32 Index, int32 UserId);
	void OnRemovedSlotlessBehavior(class AAIController* AI, bool bIsClamingSlot);
	void OnRemovedBehavior(class AAIController* AI, int32 Index, int32 UserId, enum class EAIHotSpotSlot PrevState, bool bWasOnWaitingList);
	void OnMoveToSlotFinished(class AAIController* AI, int32 Index, int32 UserId, bool bResult);
	void OnHotSpotEnabled();
	void OnHotSpotDisabled();
	bool OnAssignedSlotlessBehavior(class AAIController* AI);
	bool OnAssignedOccupiedBehavior(class AAIController* AI, int32 Index, int32 UserId);
	bool OnAssignedClaimedBehavior(class AAIController* AI, int32 Index, int32 UserId, bool bWasOnWaitingList);
	bool OccupySlotByIndex(int32 Index);
	bool IsSlotlessAssignmentAllowed();
	bool IsEnabled();
	bool IsAIAllowed(class AAIController* AI);
	bool HasEnabledSlots();
	bool HasAssignedAI(class AAIController* AI, enum class EAIHotSpotAssignmentFilter Filter);
	int32 GetSlotUserIdByIndex(int32 Index);
	enum class EAIHotSpotSlot GetSlotStateByOwner(class AAIController* AIOwner);
	enum class EAIHotSpotSlot GetSlotStateByIndex(int32 Index);
	struct FRotator GetSlotRotationByIndex(int32 Index);
	class AAIController* GetSlotOwnerByIndex(int32 Index);
	struct FVector GetSlotLocationByIndex(int32 Index);
	int32 GetSlotIndexByOwner(class AAIController* AIOwner);
	int32 GetSlotCount(enum class EAIHotSpotSlotFilter Filter);
	class UAIHotSpotSlot* GetSlotByOwner(class AAIController* AIOwner);
	class UAIHotSpotSlot* GetSlotByIndex(int32 Index);
	int32 GetAssignedAICount(enum class EAIHotSpotAssignmentFilter Filter);
	TArray<class AAIController*> GetAssignedAI(enum class EAIHotSpotAssignmentFilter Filter);
	TArray<int32> FindBestSlotIndices(const TArray<class AAIController*>& AI);
	int32 FindBestSlotIndex(class AAIController* AI);
	bool CanUseSlotByIndex(class AAIController* AI, int32 Index);
	bool AssignToSlotByIndex(class AAIController* AI, int32 Index);
	bool AssignToHotspot(class AAIController* AI);
	int32 AssignGroupToHotspot(const TArray<class AAIController*>& GroupOfAI);
	void AssignFromWaitingList();
};

// 0x58 (0x80 - 0x28)
// Class FortniteGame.AIHotSpotManagerProxy
class UAIHotSpotManagerProxy : public UAIHotSpotManager
{
public:
	uint8                                        Pad_89[0x58];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotManagerProxy* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortInventorySortFunctionLibrary
class UFortInventorySortFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFortInventorySortFunctionLibrary* GetDefaultObj();

	class FText GetCriterionDisplayNameOfSortType(enum class EInventoryContentSortType SortType);
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortBrushSizeFunctionLibrary
class UFortBrushSizeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFortBrushSizeFunctionLibrary* GetDefaultObj();

	enum class EFortBrushSize ShrinkBrushSize(enum class EFortBrushSize OriginalBrushSize, int32 Steps);
	enum class EFortBrushSize GrowBrushSize(enum class EFortBrushSize OriginalBrushSize, int32 Steps);
};

// 0x360 (0x388 - 0x28)
// Class FortniteGame.FortMultiSizeBrushAsset
class UFortMultiSizeBrushAsset : public UDataAsset
{
public:
	struct FFortMultiSizeBrush                   Brush;                                             // 0x28(0x360)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortMultiSizeBrushAsset* GetDefaultObj();

};

// 0xF0 (0x118 - 0x28)
// Class FortniteGame.BuildingActorHotSpotConfig
class UBuildingActorHotSpotConfig : public UDataAsset
{
public:
	struct FBuildingActorHotSpotDirection        DirectionSetup[0x6];                               // 0x28(0xC0)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBuildingActorHotSpotDirection        DefaultSetup;                                      // 0xE8(0x20)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotConfig*                      ExtraTypeConfig;                                   // 0x108(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDirectionalSetup : 1;                          // Mask: 0x1, PropSize: 0x10x110(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8F[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingActorHotSpotConfig* GetDefaultObj();

};

// 0x140 (0x1C0 - 0x80)
// Class FortniteGame.FortAIHotSpotManager
class UFortAIHotSpotManager : public UAIHotSpotManagerProxy
{
public:
	TSoftObjectPtr<class UBuildingActorHotSpotConfig> FallbackHotspotConfig;                             // 0x80(0x20)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_90[0xF0];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAutoAcquireSlot>              AutoAcquireSlots;                                  // 0x190(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_91[0x20];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAIHotSpotManager* GetDefaultObj();

};

// 0x28 (0x538 - 0x510)
// Class FortniteGame.FortAIHotSpot
class AFortAIHotSpot : public AAIHotSpot
{
public:
	uint8                                        Pad_92[0x28];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortAIHotSpot* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortMissionConfigData
class UFortMissionConfigData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UFortMissionConfigData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortMissionEventParams
class UFortMissionEventParams : public UObject
{
public:

	static class UClass* StaticClass();
	static class UFortMissionEventParams* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortStartMissionParams
class UFortStartMissionParams : public UFortMissionEventParams
{
public:

	static class UClass* StaticClass();
	static class UFortStartMissionParams* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortItemCollectedParams
class UFortItemCollectedParams : public UFortMissionEventParams
{
public:
	class UFortWorldItemDefinition*              CollectedItemDefinition;                           // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 CollectedBy;                                       // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountCollected;                                   // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_95[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemCollectedParams* GetDefaultObj();

	void SetParams(class UFortWorldItemDefinition* _CollectedItemDefinition, class AFortPlayerController* _CollectedBy, int32 _AmountCollected, class UFortItemCollectedParams** ThisParam);
	void BreakParams(class UFortWorldItemDefinition** _CollectedItemDefinition, class AFortPlayerController** _CollectedBy, int32* _AmountCollected);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortItemDroppedParams
class UFortItemDroppedParams : public UFortMissionEventParams
{
public:
	class UFortWorldItemDefinition*              DroppedItemDefinition;                             // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 DroppedBy;                                         // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountDropped;                                     // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_98[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemDroppedParams* GetDefaultObj();

	void SetParams(class UFortWorldItemDefinition* _DroppedItemDefinition, class AFortPlayerController* _DroppedBy, int32 _AmountCollected, class UFortItemDroppedParams** ThisParam);
	void BreakParams(class UFortWorldItemDefinition** _DroppedItemDefinition, class AFortPlayerController** _DroppedBy, int32* _AmountCollected);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortItemCraftedParams
class UFortItemCraftedParams : public UFortMissionEventParams
{
public:
	class UFortSchematicItemDefinition*          SchematicDefinition;                               // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 CraftedBy;                                         // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountCrafted;                                     // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bItemWasQuickCrafted;                              // 0x3C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9B[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemCraftedParams* GetDefaultObj();

	void SetParams(class UFortSchematicItemDefinition* _SchematicDefinition, class AFortPlayerController* _CraftedBy, int32 _AmountCrafted, bool _bItemWasQuickCrafted, class UFortItemCraftedParams** ThisParam);
	void BreakParams(class UFortSchematicItemDefinition** _SchematicDefinition, class AFortPlayerController** _CraftedBy, int32* _AmountCrafted, bool* _bItemWasQuickCrafted);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortEnemyKilledParams
class UFortEnemyKilledParams : public UFortMissionEventParams
{
public:
	class AFortPawn*                             KilledPawn;                                        // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 KilledBy;                                          // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortEnemyKilledParams* GetDefaultObj();

	void SetParams(class AFortPawn* _KilledPawn, class AFortPlayerController* _KilledBy, class UFortEnemyKilledParams** ThisParam);
	void BreakParams(class AFortPawn** _KilledPawn, class AFortPlayerController** _KilledBy);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortEnemyDamagedParams
class UFortEnemyDamagedParams : public UFortMissionEventParams
{
public:
	class AFortPawn*                             DamagedPawn;                                       // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 DamagedBy;                                         // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageAmount;                                      // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9E[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortEnemyDamagedParams* GetDefaultObj();

	void SetParams(class AFortPawn* _DamagedPawn, class AFortPlayerController* _DamagedBy, float _DamageAmount, class UFortEnemyDamagedParams** ThisParam);
	void BreakParams(class AFortPawn** _DamagedPawn, class AFortPlayerController** _DamagedBy, float* _DamageAmount);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortNewPlayerParams
class UFortNewPlayerParams : public UFortMissionEventParams
{
public:
	class AFortPlayerController*                 NewPlayerController;                               // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortNewPlayerParams* GetDefaultObj();

	void SetParams(class AFortPlayerController* _NewPlayerController, class UFortNewPlayerParams** ThisParam);
	void BreakParams(class AFortPlayerController** _NewPlayerController);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortPlayerAbandonParams
class UFortPlayerAbandonParams : public UFortMissionEventParams
{
public:
	struct FUniqueNetIdRepl                      AbandoningPlayerId;                                // 0x28(0x18)(HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerAbandonParams* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortPlayerExitParams
class UFortPlayerExitParams : public UFortMissionEventParams
{
public:
	class AFortPlayerController*                 ExitingPlayerController;                           // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerExitParams* GetDefaultObj();

	void SetParams(class AFortPlayerController* _ExitingPlayerController, class UFortPlayerExitParams** ThisParam);
	void BreakParams(class AFortPlayerController** _ExitingPlayerController);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortPlayerSpawnedParams
class UFortPlayerSpawnedParams : public UFortMissionEventParams
{
public:
	class AFortPlayerController*                 SpawnedPlayerController;                           // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerSpawnedParams* GetDefaultObj();

	void SetParams(class AFortPlayerController* _SpawnedPlayerController, class UFortPlayerSpawnedParams** ThisParam);
	void BreakParams(class AFortPlayerController** _SpawnedPlayerController);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortPlayerDiedParams
class UFortPlayerDiedParams : public UFortMissionEventParams
{
public:
	class AFortPlayerPawn*                       KilledPlayer;                                      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           KilledBy;                                          // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerDiedParams* GetDefaultObj();

	void SetParams(class AFortPlayerPawn* _KilledPlayer, class AController* _KilledBy, class UFortPlayerDiedParams** ThisParam);
	void BreakParams(class AFortPlayerPawn** _KilledPlayer, class AController** _KilledBy);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortPlayerDBNOEnterParams
class UFortPlayerDBNOEnterParams : public UFortMissionEventParams
{
public:
	class AFortPlayerPawn*                       KilledPlayer;                                      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           KilledBy;                                          // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerDBNOEnterParams* GetDefaultObj();

	void SetParams(class AFortPlayerPawn* _KilledPlayer, class AController* _KilledBy, class UFortPlayerDBNOEnterParams** ThisParam);
	void BreakParams(class AFortPlayerPawn** _KilledPlayer, class AController** _KilledBy);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortPlayerDBNORevivedParams
class UFortPlayerDBNORevivedParams : public UFortMissionEventParams
{
public:
	class AFortPlayerPawn*                       RevivedPlayer;                                     // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           RevivedBy;                                         // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerDBNORevivedParams* GetDefaultObj();

	void SetParams(class AFortPlayerPawn* _RevivedPlayer, class AController* _RevivedBy, class UFortPlayerDBNORevivedParams** ThisParam);
	void BreakParams(class AFortPlayerPawn** _RevivedPlayer, class AController** _RevivedBy);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortDayPhaseChangeParams
class UFortDayPhaseChangeParams : public UFortMissionEventParams
{
public:
	class AFortTimeOfDayManager*                 LightingAndFogManager;                             // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     NewDayPhase;                                       // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A1[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortDayPhaseChangeParams* GetDefaultObj();

	void SetParams(class AFortTimeOfDayManager* _LightingAndFogManager, enum class EFortDayPhase _NewDayPhase, class UFortDayPhaseChangeParams** ThisParam);
	void BreakParams(class AFortTimeOfDayManager** _LightingAndFogManager, enum class EFortDayPhase* _NewDayPhase);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortPlayerBuiltParams
class UFortPlayerBuiltParams : public UFortMissionEventParams
{
public:
	class ABuildingActor*                        Building;                                          // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 BuildingType;                                      // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A4[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerController*                 Builder;                                           // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPlayerBuiltParams* GetDefaultObj();

	void SetParams(class ABuildingActor* _Building, enum class EFortBuildingType _BuildingType, class AFortPlayerController* _Builder, class UFortPlayerBuiltParams** ThisParam);
	void BreakParams(class ABuildingActor** _Building, enum class EFortBuildingType* _BuildingType, class AFortPlayerController** _Builder);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortBuildingDestroyedParams
class UFortBuildingDestroyedParams : public UFortMissionEventParams
{
public:
	class ABuildingActor*                        Building;                                          // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 BuildingType;                                      // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A7[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           Destroyer;                                         // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortBuildingDestroyedParams* GetDefaultObj();

	void SetParams(class ABuildingActor* _Building, enum class EFortBuildingType _BuildingType, class AController* _Destroyer, class UFortBuildingDestroyedParams** ThisParam);
	void BreakParams(class ABuildingActor** _Building, enum class EFortBuildingType* _BuildingType, class AController** _Destroyer);
};

// 0x20 (0x48 - 0x28)
// Class FortniteGame.FortBuildingEditedParams
class UFortBuildingEditedParams : public UFortMissionEventParams
{
public:
	class ABuildingActor*                        OriginalBuilding;                                  // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingActor*                        NewBuilding;                                       // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 BuildingType;                                      // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AA[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerController*                 Editor;                                            // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortBuildingEditedParams* GetDefaultObj();

	void SetParams(class ABuildingActor* _OriginalBuilding, class ABuildingActor* _NewBuilding, enum class EFortBuildingType _BuildingType, class AFortPlayerController* _Editor, class UFortBuildingEditedParams** ThisParam);
	void BreakParams(class ABuildingActor** _OriginalBuilding, class ABuildingActor** _NewBuilding, enum class EFortBuildingType* _BuildingType, class AFortPlayerController** _Editor);
};

// 0x20 (0x48 - 0x28)
// Class FortniteGame.FortBuildingDamagedParams
class UFortBuildingDamagedParams : public UFortMissionEventParams
{
public:
	class ABuildingActor*                        Building;                                          // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 BuildingType;                                      // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AF[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           DamagedBy;                                         // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B0[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortBuildingDamagedParams* GetDefaultObj();

	void SetParams(class ABuildingActor* _Building, enum class EFortBuildingType _BuildingType, class AController* _DamagedBy, float _DamageAmount, class UFortBuildingDamagedParams** ThisParam);
	void BreakParams(class ABuildingActor** _Building, enum class EFortBuildingType* _BuildingType, class AController** _DamagedBy, float* _DamageAmount);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortMissionSucceededParams
class UFortMissionSucceededParams : public UFortMissionEventParams
{
public:
	class AFortMission*                          SucceededMission;                                  // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortMissionSucceededParams* GetDefaultObj();

	void SetParams(class AFortMission* _SucceededMission, class UFortMissionSucceededParams** ThisParam);
	void BreakParams(class AFortMission** _SucceededMission);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortMissionFailedParams
class UFortMissionFailedParams : public UFortMissionEventParams
{
public:
	class AFortMission*                          FailedMission;                                     // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortMissionFailedParams* GetDefaultObj();

	void SetParams(class AFortMission* _FailedMission, class UFortMissionFailedParams** ThisParam);
	void BreakParams(class AFortMission** _FailedMission);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortMissionForceSuccessParams
class UFortMissionForceSuccessParams : public UFortMissionEventParams
{
public:
	float                                        FractionCompleted;                                 // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B2[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortMissionForceSuccessParams* GetDefaultObj();

	void SetParams(float _FractionCompleted, class UFortMissionForceSuccessParams** ThisParam);
	void BreakParams(float* _FractionCompleted);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortMissionNeutralCompleteParams
class UFortMissionNeutralCompleteParams : public UFortMissionEventParams
{
public:
	class AFortMission*                          NeutrallyCompletedMission;                         // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortMissionNeutralCompleteParams* GetDefaultObj();

	void SetParams(class AFortMission* _NeutrallyCompletedMission, class UFortMissionNeutralCompleteParams** ThisParam);
	void BreakParams(class AFortMission** _NeutrallyCompletedMission);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortObjectiveSucceededParams
class UFortObjectiveSucceededParams : public UFortMissionEventParams
{
public:
	class AFortObjectiveBase*                    SucceededObjective;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortObjectiveSucceededParams* GetDefaultObj();

	void SetParams(class AFortObjectiveBase* _SucceededObjective, class UFortObjectiveSucceededParams** ThisParam);
	void BreakParams(class AFortObjectiveBase** _SucceededObjective);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortObjectiveFailedParams
class UFortObjectiveFailedParams : public UFortMissionEventParams
{
public:
	class AFortObjectiveBase*                    FailedObjective;                                   // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortObjectiveFailedParams* GetDefaultObj();

	void SetParams(class AFortObjectiveBase* _FailedObjective, class UFortObjectiveFailedParams** ThisParam);
	void BreakParams(class AFortObjectiveBase** _FailedObjective);
};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortObjectiveNeutralCompleteParams
class UFortObjectiveNeutralCompleteParams : public UFortMissionEventParams
{
public:
	class AFortObjectiveBase*                    NeutrallyCompletedObjective;                       // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortObjectiveNeutralCompleteParams* GetDefaultObj();

	void SetParams(class AFortObjectiveBase* _NeutrallyCompletedObjective, class UFortObjectiveNeutralCompleteParams** ThisParam);
	void BreakParams(class AFortObjectiveBase** _NeutrallyCompletedObjective);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortToggledCursorModeParams
class UFortToggledCursorModeParams : public UFortMissionEventParams
{
public:
	class AFortPlayerController*                 PlayerThatToggledCursorMode;                       // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInCursorMode;                                     // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B5[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortToggledCursorModeParams* GetDefaultObj();

	void SetParams(class AFortPlayerController* _PlayerThatToggledCursorMode, bool InCursorMode, class UFortToggledCursorModeParams** ThisParam);
	void BreakParams(class AFortPlayerController** _PlayerThatToggledCursorMode, bool* InCursorMode);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortToggledOptionsMenuParams
class UFortToggledOptionsMenuParams : public UFortMissionEventParams
{
public:
	class AFortPlayerController*                 PlayerThatToggledOptionsMenu;                      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInOptionsMenu;                                    // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B8[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortToggledOptionsMenuParams* GetDefaultObj();

	void SetParams(class AFortPlayerController* _PlayerThatToggledOptionsMenu, bool Opened, class UFortToggledOptionsMenuParams** ThisParam);
	void BreakParams(class AFortPlayerController** _PlayerThatToggledOptionsMenu, bool* Opened);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortToggledEditModeParams
class UFortToggledEditModeParams : public UFortMissionEventParams
{
public:
	class AFortPlayerController*                 PlayerThatToggledEditMode;                         // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingSMActor*                      EditableActor;                                     // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInEditMode;                                       // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BB[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortToggledEditModeParams* GetDefaultObj();

	void SetParams(class AFortPlayerController* _PlayerThatToggledEditMode, class ABuildingSMActor* InEditableActor, bool InEditMode, class UFortToggledEditModeParams** ThisParam);
	void BreakParams(class AFortPlayerController** _PlayerThatToggledEditMode, class ABuildingSMActor** EditableActor, bool* InEditMode);
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortShutdownParams
class UFortShutdownParams : public UFortMissionEventParams
{
public:

	static class UClass* StaticClass();
	static class UFortShutdownParams* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortPvPVictoryParams
class UFortPvPVictoryParams : public UFortMissionEventParams
{
public:
	enum class EFortTeam                         WinningTeam;                                       // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BC[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortPvPVictoryParams* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class FortniteGame.FortStartLeavingZoneParams
class UFortStartLeavingZoneParams : public UFortMissionEventParams
{
public:
	class AFortPlayerPawn*                       PlayerRequestingLeaving;                           // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortStartLeavingZoneParams* GetDefaultObj();

	void BreakParams(class AFortPlayerPawn** _PlayerRequestingLeaving);
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortInteractInterface
class IFortInteractInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortInteractInterface* GetDefaultObj();

	bool ServerOnAttemptInteract(struct FInteractionType& InteractType);
};

// 0x0 (0x30 - 0x30)
// Class FortniteGame.FortAttributeSet
class UFortAttributeSet : public UAttributeSet
{
public:

	static class UClass* StaticClass();
	static class UFortAttributeSet* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortDamageableActorInterface
class IFortDamageableActorInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortDamageableActorInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortTeamActorInterface
class IFortTeamActorInterface : public IGenericTeamAgentInterface
{
public:

	static class UClass* StaticClass();
	static class IFortTeamActorInterface* GetDefaultObj();

	enum class EFortTeam GetTeam();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortInitializationInterface
class IFortInitializationInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortInitializationInterface* GetDefaultObj();

	void WorldReady();
	bool NeedsWorldReady();
	void MatchStarted();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortSpawnableByPlacementSystemInterface
class IFortSpawnableByPlacementSystemInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortSpawnableByPlacementSystemInterface* GetDefaultObj();

	struct FGuid GetMissionGuid();
	class AFortMission* GetMission();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortAbilitySystemInterface
class IFortAbilitySystemInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortAbilitySystemInterface* GetDefaultObj();

};

// 0x3B0 (0x738 - 0x388)
// Class FortniteGame.BuildingActor
class ABuildingActor : public AActor
{
public:
	uint8                                        Pad_CF[0x68];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortBuildingType                 BuildingType;                                      // 0x3F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D0[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 MyGuid;                                            // 0x3F4(0x10)(Net, DuplicateTransient, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D1[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  InteractionText;                                   // 0x408(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  DisplayName;                                       // 0x420(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        OwnerPersistentID;                                 // 0x438(0x4)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D2[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UNavArea>                AreaClass;                                         // 0x440(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavLinkDefinition>      NavigationLinksClass;                              // 0x460(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D3[0x10];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SavedHealthPct;                                    // 0x490(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasRegisteredActorStateAtLeastOnce : 1;           // Mask: 0x1, PropSize: 0x10x494(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDirtyForLevelRecordSave : 1;                      // Mask: 0x2, PropSize: 0x10x494(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSavedMetaPropertiesProcessed : 1;                 // Mask: 0x4, PropSize: 0x10x494(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_2 : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D4[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentBuildingLevel;                              // 0x498(0x4)(Edit, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaximumBuildingLevel;                              // 0x49C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUpgradeUsesSameClass : 1;                         // Mask: 0x1, PropSize: 0x10x4A0(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDisplayLevelInInfoWidget : 1;                     // Mask: 0x2, PropSize: 0x10x4A0(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowUpgradeRegardlessOfPlayerBuildLevel : 1;     // Mask: 0x4, PropSize: 0x10x4A0(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_3 : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D5[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortBuildingActorSet>     BuildingAttributeSetClass;                         // 0x4A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBuildingActorSet*                 BuildingAttributeSet;                              // 0x4B0(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortAttributeInitializationKey       AttributeInitKey;                                  // 0x4B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	enum class EAttributeInitLevelSource         AttributeInitLevelSource;                          // 0x4C8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAbilitySystemComponentCreationPolicy AbilitySystemComponentCreationPolicy;              // 0x4C9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D6[0x6];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAbilitySystemComponent*           AbilitySystemComponent;                            // 0x4D0(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayCueParameters>        PendingDamageImpactCues;                           // 0x4D8(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bIsInvulnerable : 1;                               // Mask: 0x1, PropSize: 0x10x4E8(0x1)(BlueprintVisible, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSurpressHealthBar : 1;                            // Mask: 0x2, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCreateVerboseHealthLogs : 1;                      // Mask: 0x4, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsIndestructibleForTargetSelection : 1;           // Mask: 0x8, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_4 : 4;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D7[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DefaultTags;                                       // 0x4F0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 ConstTags;                                         // 0x510(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 StaticGameplayTags;                                // 0x530(0x20)(Protected, NativeAccessSpecifierProtected)
	enum class EDynamicBuildingPlacementType     DynamicBuildingPlacementType;                      // 0x550(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavigationObstacleOverride       NavigationObstacleOverride;                        // 0x551(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D8[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bDestroyed : 1;                                    // Mask: 0x1, PropSize: 0x10x554(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPersistToWorld : 1;                               // Mask: 0x2, PropSize: 0x10x554(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRefreshFullSaveDataBeforeZoneSave : 1;            // Mask: 0x4, PropSize: 0x10x554(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBeingDragged : 1;                                 // Mask: 0x8, PropSize: 0x10x554(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRotateInPlaceGame : 1;                            // Mask: 0x10, PropSize: 0x10x554(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_5 : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsNavigationModifier : 1;                         // Mask: 0x40, PropSize: 0x10x554(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlockNavigationLinks : 1;                         // Mask: 0x80, PropSize: 0x10x554(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanExportNavigationCollisions : 1;                // Mask: 0x1, PropSize: 0x10x555(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanExportNavigationObstacle : 1;                  // Mask: 0x2, PropSize: 0x10x555(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorNavLinksX : 1;                              // Mask: 0x4, PropSize: 0x10x555(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorNavLinksY : 1;                              // Mask: 0x8, PropSize: 0x10x555(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreMoveGoalCollisionRadius : 1;                // Mask: 0x10, PropSize: 0x10x555(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceDisableRootNavigationRelevance : 1;          // Mask: 0x20, PropSize: 0x10x555(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass : 1;                          // Mask: 0x40, PropSize: 0x10x555(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass_NavmeshOnTop : 1;             // Mask: 0x80, PropSize: 0x10x555(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass_SmashableFlat : 1;            // Mask: 0x1, PropSize: 0x10x556(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWorldReadyCalled : 1;                             // Mask: 0x2, PropSize: 0x10x556(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseDefaultCullDistance : 1;                       // Mask: 0x4, PropSize: 0x10x556(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBeingRotatedOrScaled : 1;                         // Mask: 0x8, PropSize: 0x10x556(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBeingTranslated : 1;                              // Mask: 0x10, PropSize: 0x10x556(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRotateInPlaceEditor : 1;                          // Mask: 0x20, PropSize: 0x10x556(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bEditorPlaced : 1;                                 // Mask: 0x40, PropSize: 0x10x556(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPlayerPlaced : 1;                                 // Mask: 0x80, PropSize: 0x10x556(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldTick : 1;                                   // Mask: 0x1, PropSize: 0x10x557(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUsesDayPhaseChange : 1;                           // Mask: 0x2, PropSize: 0x10x557(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsDynamic : 1;                                    // Mask: 0x4, PropSize: 0x10x557(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsDynamicOnDedicatedServer : 1;                   // Mask: 0x8, PropSize: 0x10x557(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsMovable : 1;                                    // Mask: 0x10, PropSize: 0x10x557(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisteredForDayPhaseChange : 1;                  // Mask: 0x20, PropSize: 0x10x557(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceDamagePing : 1;                              // Mask: 0x40, PropSize: 0x10x557(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyFoliageWhenPlaced : 1;                     // Mask: 0x80, PropSize: 0x10x557(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bObstructTrapTargeting : 1;                        // Mask: 0x1, PropSize: 0x10x558(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_6 : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D9[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LDMaxDrawDistance;                                 // 0x55C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifespanAfterDeath;                                // 0x560(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDoNotBlockBuildings : 1;                          // Mask: 0x1, PropSize: 0x10x564(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDestroyOnPlayerBuildingPlacement : 1;             // Mask: 0x2, PropSize: 0x10x564(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseCentroidForBlockBuildingsCheck : 1;            // Mask: 0x4, PropSize: 0x10x564(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsPlayerBuildable : 1;                            // Mask: 0x8, PropSize: 0x10x564(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7 : 4;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_DA[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnDied;                                            // 0x568(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDamaged;                                         // 0x578(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bFireBuiltAndDestroyedEvents;                      // 0x588(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DB[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortMission*                          AssociatedMissionParam;                            // 0x590(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPhysicalSurface                  PrimarySurfaceType;                                // 0x598(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBaseWeaponDamage             WeaponResponseType;                                // 0x599(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DC[0x6];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlacementActor*                   OriginatingPlacementActor;                         // 0x5A0(0x8)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnInteract;                                        // 0x5A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bAllowInteract;                                    // 0x5B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowHostileBlueprintInteraction;                 // 0x5B9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DD[0x6];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCurveTableRowHandle                  InteractionSpeed;                                  // 0x5C0(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE[0xE0];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DataVersion;                                       // 0x6B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastTakeHitTimeTimeout;                            // 0x6B4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortDamageSource>             CurFrameDmgSources;                                // 0x6B8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                        CullDistance;                                      // 0x6C8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHighlightState;                                   // 0x6CC(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRequestedHighlightState;                          // 0x6CD(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DF[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            PlayHitSound;                                      // 0x6D0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SnapGridSize;                                      // 0x6D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        VertSnapGridSize;                                  // 0x6DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               SnapOffset;                                        // 0x6E0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CentroidOffset;                                    // 0x6EC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               BaseLocToPivotOffset;                              // 0x6F8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E0[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomState;                                       // 0x708(0x10)(Net, ZeroConstructor, SaveGame, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bForceReplayRollback;                              // 0x718(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         Team;                                              // 0x719(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E1[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsNavigationRelevant : 1;                         // Mask: 0x1, PropSize: 0x10x71C(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBlockNavLinksInCell : 1;                          // Mask: 0x2, PropSize: 0x10x71C(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseHotSpotAsMoveGoalReplacement : 1;              // Mask: 0x4, PropSize: 0x10x71C(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_8 : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E2[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UBuildingActorHotSpotConfig*           HotSpotConfig;                                     // 0x720(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnBuildingHealthChanged;                           // 0x728(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABuildingActor* GetDefaultObj();

	bool UseDefaultHealthBar();
	void SilentDie();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SetNavigationModifier(bool bEnableModifier);
	void SetCustomState(const class FString& NewState);
	void SetCanExportNavigationObstacle(bool InCanExportNavigationObstacle);
	void RemoveEditorOnlyInstanceGameplayTags(struct FGameplayTagContainer& TagsToRemove);
	void PlacedByPlacementTool();
	void OnWorldReady();
	void OnRep_CustomState();
	void OnRep_CurrentBuildingLevel();
	void OnRep_BuildingAttributeSet();
	void OnRep_bForceReplayRollback();
	void OnRep_AbilitySystemComponent();
	void OnMatchStarted();
	void OnDeathServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDayPhaseChanged(enum class EFortDayPhase CurrentDayPhase, enum class EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void OnDamageServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBuildingActorInitialized(enum class EFortBuildingInitializationReason InitializationReason, enum class EFortBuildingPersistentState BuildingPersistentState);
	bool IsPlayerBuilt();
	bool IsDamaged();
	bool IsAcceptablePositionForPlacement(struct FVector& InLocation, struct FRotator& InRotation, class AFortDecoTool* DecoTool, bool bIsCDO, class FText* OutFailureReason);
	void InitializeKismetSpawnedBuildingActor(class ABuildingActor* BuildingOwner, class AFortPlayerController* SpawningController);
	bool HasHealthLeft();
	void HandleDestroyed();
	class AFortPlayerState* GetOwningPlayerState();
	class AController* GetOwningController();
	float GetMissingHealth();
	float GetMaxHealth();
	float GetHealthPercent();
	float GetHealth();
	void GetEditorTestTags(struct FGameplayTagContainer* TagContainer);
	class FString GetCustomState();
	int32 GetCurrentBuildingLevel();
	struct FVector GetCentroid();
	void GameplayCue_InstantDeath(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Healing(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ForceBuildingHealth(float NewHealth);
	void CustomStateChanged();
	bool BlueprintOnLocalInteract(class AFortPlayerPawn* InteractingPawn);
	void BlueprintOnInteract(class AFortPawn* InteractingPawn);
	void BlueprintOnBeginInteract();
	class FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn);
	class FText BlueprintGetFailedInteractionString(class AFortPawn* InteractingPawn);
	bool BlueprintCanInteract(class AFortPawn* InteractingPawn);
	void AddEditorOnlyInstanceGameplayTags(struct FGameplayTagContainer& NewTags);
};

// 0xC8 (0x450 - 0x388)
// Class FortniteGame.FortCrackEffect
class AFortCrackEffect : public AActor
{
public:
	uint8                                        Pad_E3[0x20];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bFadingOut;                                        // 0x3A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E4[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class ABuildingSMActor>       ParentBuilding;                                    // 0x3AC(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHit : 1;                                          // Mask: 0x1, PropSize: 0x10x3B4(0x1)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_9 : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E5[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CrackHitCount;                                     // 0x3B8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CrackLevel;                                        // 0x3BC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCrackLevel;                                     // 0x3C0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                   StartingLocation;                                  // 0x3C4(0xC)(Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal             StartingNormal;                                    // 0x3D0(0xC)(Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal             HitNormal;                                         // 0x3DC(0xC)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	enum class EPhysicalSurface                  PhysicalSurfaceType;                               // 0x3E8(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E6[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UPhysicalMaterial>      WoodMaterial;                                      // 0x3F0(0x20)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UPhysicalMaterial>      StoneMaterial;                                     // 0x410(0x20)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UPhysicalMaterial>      MetalMaterial;                                     // 0x430(0x20)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AFortCrackEffect* GetDefaultObj();

	void OnStartDirectionEffect();
	void OnRep_PhysicalSurfaceType();
	void OnRep_HitNormal();
	void OnHitCrack();
	void OnFadeOut();
	void OnBounceAnimationUpdate(const struct FFortBounceData& BounceData);
	void NetOnHitCrack();
	void NetFadeOut();
	bool HasStartingPosition();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortAttachToActorInterface
class IFortAttachToActorInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortAttachToActorInterface* GetDefaultObj();

	class AActor* GetActorAttachedTo();
};

// 0x888 (0xFC0 - 0x738)
// Class FortniteGame.BuildingSMActor
class ABuildingSMActor : public ABuildingActor
{
public:
	uint8                                        Pad_F0[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UBuildingTextureData*                  TextureData[0x4];                                  // 0x740(0x20)(Edit, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           StaticMesh;                                        // 0x760(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTierMeshSets>                 AlternateMeshes;                                   // 0x768(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        AltMeshIdx;                                        // 0x778(0x4)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortResourceType                 ResourceType;                                      // 0x77C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F1[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bAllowBuildingCheat : 1;                           // Mask: 0x1, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrored : 1;                                     // Mask: 0x2, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoCollision : 1;                                  // Mask: 0x4, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoCameraCollision : 1;                            // Mask: 0x8, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoPawnCollision : 1;                              // Mask: 0x10, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoAIPawnCollision : 1;                            // Mask: 0x20, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoWeaponCollision : 1;                            // Mask: 0x40, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoRangedWeaponCollision : 1;                      // Mask: 0x80, PropSize: 0x10x780(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoProjectileCollision : 1;                        // Mask: 0x1, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDoNotBlockInteract : 1;                           // Mask: 0x2, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlocksCeilingPlacement : 1;                       // Mask: 0x4, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlocksAttachmentPlacement : 1;                    // Mask: 0x8, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSupportsRepairing : 1;                            // Mask: 0x10, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRandomYawOnPlacement : 1;                         // Mask: 0x20, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRandomScaleOnPlacement : 1;                       // Mask: 0x40, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClearMIDWhenReturningToUndamagedState : 1;        // Mask: 0x80, PropSize: 0x10x781(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             RandomScaleRange;                                  // 0x784(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortBounceData                       BounceData;                                        // 0x78C(0x30)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_F3[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  BASEEffectMeshComponent;                           // 0x7C0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuildingNavObstacle>          NavObstacles;                                      // 0x7C8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                  CachedNavAreaHusk;                                 // 0x7D8(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                  CachedNavAreaSmasher;                              // 0x7E0(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F4[0x18];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class AFortCrackEffect>> WeakSpotEffects;                                   // 0x800(0x10)(Net, ZeroConstructor, Transient, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                         bAllowWeakSpots;                                   // 0x810(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseComplexForWeakSpots;                           // 0x811(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F5[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector_NetQuantize100                ReplicatedDrawScale3D;                             // 0x814(0xC)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*             ReplicatedMIC;                                     // 0x820(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FEditorOnlyBuildingInstanceMaterialParameters EditorOnlyInstanceMaterialParameters;              // 0x828(0x30)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  StaticMeshComponent;                               // 0x858(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                    BaseMaterial;                                      // 0x860(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ELootQuotaLevel                   MaximumQuotaLevelBound;                            // 0x868(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F6[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bCanSpawnAtLowerQuotaLevels : 1;                   // Mask: 0x1, PropSize: 0x10x86C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_A : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F7[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DestructionLootTierGroup;                          // 0x870(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FChosenQuotaInfo                      DestructionLootTierChosenQuotaInfo;                // 0x878(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                  DestructionLootTierKey;                            // 0x888(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  BuildingResourceAmountOverride;                    // 0x890(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxResourcesToSpawn;                               // 0x8A0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F8[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InfluenceMapWeight;                                // 0x8A8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bNeedsWindMaterialParameters;                      // 0x8AC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F9[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UCurveLinearColor>      WindSpeedCurve;                                    // 0x8B0(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UCurveLinearColor>      WindPannerSpeedCurve;                              // 0x8D0(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UMaterialInterface>> IntenseWindMaterials;                              // 0x8F0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             WindAudio;                                         // 0x900(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPropagatesBounceEffects;                          // 0x920(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FA[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystem*                       BreakEffect;                                       // 0x928(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       DeathParticles;                                    // 0x930(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  DeathParticleSocketName;                           // 0x938(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                            DeathSound;                                        // 0x940(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       ConstructedEffect;                                 // 0x948(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ShieldBuffMaterialParamValue1;                     // 0x950(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ShieldBuffMaterialParamValue2;                     // 0x954(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AnimatingDistanceFieldSelfShadowBias;              // 0x958(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bNeedsDamageOverlay;                               // 0x95C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FB[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRandomDayphaseFX>             RandomDayphaseFXList;                              // 0x960(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UAudioComponent*                       ConstructionAudioComponent;                        // 0x970(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      AnimatingMIDs;                                     // 0x978(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  DamageOverlayComponent;                            // 0x988(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              MIDDamageOverlay;                                  // 0x990(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageAmountStart;                                 // 0x998(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastDamageAmount;                                  // 0x99C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FHitResult                            LastDamageHit;                                     // 0x9A0(0x88)(Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_FC[0x1C8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BuildingPlacementDistance;                         // 0xBF0(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FD[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UBuildingEditModeMetadata*             EditModePatternData;                               // 0xC00(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnRepairBuildingStarted;                           // 0xC08(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnRepairBuildingFinished;                          // 0xC18(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFortConnectivityComponentData        ConnectivityData;                                  // 0xC28(0x18)(SaveGame, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    AnimatingMaterial;                                 // 0xC40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    DamagedButNotAnimatingMaterial;                    // 0xC48(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortDamageVisualsState           DamageVisualsState;                                // 0xC50(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FE[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AnimatingSubObjects;                               // 0xC54(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumFrameSubObjects;                                // 0xC58(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FF[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UBuildingEditModeSupport>  EditModeSupportClass;                              // 0xC60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeSupport*              EditModeSupport;                                   // 0xC68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HealthToAutoBuild;                                 // 0xC70(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AccumulatedAutoBuildTime;                          // 0xC74(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsInitiallyBuilding;                              // 0xC78(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingReplacementType          BuildingReplacementType;                           // 0xC79(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingReplacementType          ReplacementDestructionReason;                      // 0xC7A(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAnim                     CurBuildingAnimType;                               // 0xC7B(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurAnimSubObjectNum;                               // 0xC7C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurBuildingAnimStartTime;                          // 0xC80(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurAnimSubObjectTargetNum;                         // 0xC84(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      BlueprintMIDs;                                     // 0xC88(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  BlueprintMeshComp;                                 // 0xC98(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerStateZone*                  EditingPlayer;                                     // 0xCA0(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        LogicalBuildingIdx;                                // 0xCA8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        UndermineGroup;                                    // 0xCAC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EStructuralSupportCheck           LastStructuralCheck;                               // 0xCB0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_100[0x7F];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            ConnectivityIcon;                                  // 0xD30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               BuildingAttachmentPointOffset;                     // 0xD38(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BuildingAttachmentRadius;                          // 0xD44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAttachmentSlot           BuildingAttachmentSlot;                            // 0xD48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAttachmentType           BuildingAttachmentType;                            // 0xD49(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_101[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABuildingSMActor*                      ParentActorToAttachTo;                             // 0xD50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPlacementType                    BuildingPlacementType;                             // 0xD58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_102[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PlayerGridSnapSize;                                // 0xD5C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABuildingSMActor*>              AttachedBuildingActors;                            // 0xD60(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class ABuildingSMActor*>              BuildingActorsAttachedTo;                          // 0xD70(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	UMulticastDelegateProperty_                  OnTrapPlacementChanged;                            // 0xD80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class ABuildingSMActor*>              AttachmentPlacementBlockingActors;                 // 0xD90(0x10)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UBuildingConnectivityComponent*        ConnectivityComponent;                             // 0xDA0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_103[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimeline                             RepairAnimTimeline;                                // 0xDB0(0xE0)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        bAllowResourceDrop : 1;                            // Mask: 0x1, PropSize: 0x10xE90(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHideOnDeath : 1;                                  // Mask: 0x2, PropSize: 0x10xE90(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPlayDestructionEffects : 1;                       // Mask: 0x4, PropSize: 0x10xE90(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportedDirectly : 1;                            // Mask: 0x8, PropSize: 0x10xE90(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForciblyStructurallySupported : 1;                // Mask: 0x10, PropSize: 0x10xE90(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisterWithStructuralGrid : 1;                   // Mask: 0x20, PropSize: 0x10xE90(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnderConstruction : 1;                            // Mask: 0x40, PropSize: 0x10xE90(0x1)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnderRepair : 1;                                  // Mask: 0x80, PropSize: 0x10xE90(0x1)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCollisionBlockedByPawns : 1;                      // Mask: 0x1, PropSize: 0x10xE91(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_B : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCurrentlyBeingEdited : 1;                         // Mask: 0x4, PropSize: 0x10xE91(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_C : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_104[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABuildingSMActor*                      DamagerOwner;                                      // 0xE98(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimeline                             DynamicLODEffectTimeline;                          // 0xEA0(0xE0)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class AFortConstructorBASE*                  RelevantBASE;                                      // 0xF80(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_105[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortConstructorBASE*                  LastRelevantBASE;                                  // 0xFA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_106[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingSMActor* GetDefaultObj();

	bool WillRegisterWithStructuralGrid();
	void UpdateRepairMaterialAnim(float CurveValue);
	void UpdateLODOverrideEffect(float CurveValue);
	void UpdateDynamicShrinkAndDestroyEffect(float CurveValue);
	void RepairBuilding(class AFortPlayerController* RepairingController, int32 ResourcesSpent);
	void OnRepairStarted();
	void OnRep_WeakSpotPositions();
	void OnRep_ResourceType(enum class EFortResourceType OldType);
	void OnRep_ReplicatedMIC();
	void OnRep_ReplicatedDrawScale3D();
	void OnRep_RelevantBASE();
	void OnRep_MetaData();
	void OnRep_EditingPlayer();
	void OnRep_bUnderRepair();
	void OnRep_bUnderConstruction();
	void OnRep_BuildingReplacementType();
	void OnRep_bCollisionBlockedByPawns();
	void OnLODOverrideEffectFinished();
	void OnDynamicShrinkAndDestroyEffectFinished();
	void OnDetachFromBuilding(class ABuildingSMActor* AttachedToBuilding, bool bBeingDestroyed);
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void OnAttachToBuilding(class ABuildingSMActor* AttachedToBuilding);
	void MulticastRequestBuildingAnimation(enum class EBuildingAnim RequestedAnimation);
	void MulticastPlayFullHealthEffects();
	void MarkConnectedBuildingsForStructuralIntegrityCheck();
	bool IsSupportedByWorld();
	bool IsStructurallySupported();
	bool HasDestructionLoot();
	class UCurveLinearColor* GetWindSpeedCurveForPreview();
	class UCurveLinearColor* GetWindPannerSpeedCurveForPreview();
	enum class EBuildingReplacementType GetReplacementDestructionReason();
	int32 GetLogicalBuildingIndex();
	bool GetIntenseWindMaterialsForPreview(TArray<class UMaterialInterface*>* Materials);
	class UStaticMeshComponent* GetBuildingMeshComponent();
	TArray<class ABuildingSMActor*> GetAttachedBuildingActors();
	class UMaterialInstanceDynamic* GetAnimatingMID(int32 ElementIndex);
	void GameplayCue_Abilities_Activation_Generic_BannerWallBuff2(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Generic_BannerWallBuff1(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ForceIntoStructuralGridDuringRuntime();
	void EditorOnlySetInstanceMaterialVectorParameter(class FName ParamName, const struct FLinearColor& Value);
	void EditorOnlySetInstanceMaterialTextureParameter(class FName ParamName, class UTexture* Value);
	void EditorOnlySetInstanceMaterialScalarParameter(class FName ParamName, float Value);
	void EditorOnlyRemoveInstanceMaterialVectorParameter(class FName ParamName);
	void EditorOnlyRemoveInstanceMaterialTextureParameter(class FName ParamName);
	void EditorOnlyRemoveInstanceMaterialScalarParameter(class FName ParamName);
	void DetachBuildingActorFromMe(class ABuildingSMActor* ActorToAttach, bool bBeingDestroyed);
	void BlueprintOnStructurallyUnstable();
	void BlueprintOnStructurallyStable();
	void AttachBuildingActorToMe(class ABuildingSMActor* ActorToAttach, bool bForceAttachment);
};

// 0x268 (0x290 - 0x28)
// Class FortniteGame.BuildingEditModeSupport
class UBuildingEditModeSupport : public UObject
{
public:
	class ABuildingSMActor*                      OwnerBuilding;                                     // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerController*                 EditingController;                                 // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeMetadata*             PreviewMetadata;                                   // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeMetadata*             ScratchpadMetadata;                                // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UBuildingEditModeMetadata> ExpectedMetadataClass;                             // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class ABuildingSMActor>>  PossibleEditClasses;                               // 0x50(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>            EditTileMesh;                                      // 0x60(0x20)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>          EditTileMeshComponents;                            // 0x80(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>     TileMaterialParent;                                // 0x90(0x20)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             ActiveTileTexture;                                 // 0xB0(0x20)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             InactiveTileTexture;                               // 0xD0(0x20)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  LastInteractedComp;                                // 0xF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  LastHighlightedComp;                               // 0xF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  PreviewComponent;                                  // 0x100(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>     PreviewMaterial;                                   // 0x108(0x20)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FEditModeState                        PreviewEditModeState;                              // 0x128(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UCurveFloat>            SuccessfulPatternMatchCurve;                       // 0x138(0x20)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_107[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimeline                             SuccessfulMatchInteractTimeline;                   // 0x160(0xE0)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        bCanMirrorMetadataToMatch : 1;                     // Mask: 0x1, PropSize: 0x10x240(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanRotateMetadataToMatch : 1;                     // Mask: 0x2, PropSize: 0x10x240(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bEditActionInProgress : 1;                         // Mask: 0x4, PropSize: 0x10x240(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInitializedTimelines : 1;                         // Mask: 0x8, PropSize: 0x10x240(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_108[0x4F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport* GetDefaultObj();

	void OnSuccessfulMatchInteractParamUpdate(float NewInteractParamVal);
	void OnSuccessfulMatchInteractComplete();
};

// 0x448 (0x470 - 0x28)
// Class FortniteGame.BuildingStructuralSupportSystem
class UBuildingStructuralSupportSystem : public UObject
{
public:
	uint8                                        Pad_10C[0x240];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABuildingLayoutRequirement*>    LayoutRequirementActorsToRegister;                 // 0x268(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10D[0x1E8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortNavigationGraph*                  NavGraph;                                          // 0x460(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingStructuralSupportSystem* GetDefaultObj();

	void K2_GetLogicalBuildingActors(int32 LogicalIdx, TArray<class ABuildingSMActor*>* LogicalBuildingActors);
	bool IsBuildingActorStructurallySupported(class ABuildingSMActor* ActorToCheck);
	void GetLogicalBuildingGroundSupportedActors(int32 LogicalIndex, TArray<class ABuildingSMActor*>* LogicalBuildingGroundSupportedActors);
};

// 0x88 (0x5C0 - 0x538)
// Class FortniteGame.FortAIHotSpot_Building
class AFortAIHotSpot_Building : public AFortAIHotSpot
{
public:
	class UAIHotSpotConfig*                      ExtraTypeConfig;                                   // 0x538(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10F[0x80];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortAIHotSpot_Building* GetDefaultObj();

};

// 0x0 (0x538 - 0x538)
// Class FortniteGame.FortAIHotSpot_FakeBuilding
class AFortAIHotSpot_FakeBuilding : public AFortAIHotSpot
{
public:

	static class UClass* StaticClass();
	static class AFortAIHotSpot_FakeBuilding* GetDefaultObj();

};

// 0x0 (0x538 - 0x538)
// Class FortniteGame.FortAIHotSpot_Shooting
class AFortAIHotSpot_Shooting : public AFortAIHotSpot
{
public:

	static class UClass* StaticClass();
	static class AFortAIHotSpot_Shooting* GetDefaultObj();

};

// 0x20 (0x48 - 0x28)
// Class FortniteGame.AIHotSpotConfig
class UAIHotSpotConfig : public UDataAsset
{
public:
	TArray<struct FAIHotSpotSlotConfig>          Slots;                                             // 0x28(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        bDetectUnreachableSlots : 1;                       // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_110[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlotGenerator*               SlotGenerator;                                     // 0x40(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIHotSpotConfig* GetDefaultObj();

};

// 0x0 (0x670 - 0x670)
// Class FortniteGame.AIHotSpotRenderingComponent
class UAIHotSpotRenderingComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UAIHotSpotRenderingComponent* GetDefaultObj();

};

// 0x10 (0xD0 - 0xC0)
// Class FortniteGame.FortAIHotSpotSlot
class UFortAIHotSpotSlot : public UAIHotSpotSlot
{
public:
	enum class EFortHotSpotSlot                  SlotType;                                          // 0xC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_111[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bHasProjectedLocation : 1;                         // Mask: 0x1, PropSize: 0x10xC4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bProjectedOnLowArea : 1;                           // Mask: 0x2, PropSize: 0x10xC4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsAutoGenerated : 1;                              // Mask: 0x4, PropSize: 0x10xC4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanDuplicateOnProjection : 1;                     // Mask: 0x8, PropSize: 0x10xC4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanProjectUp : 1;                                 // Mask: 0x10, PropSize: 0x10xC4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_112[0xB];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAIHotSpotSlot* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.AIHotSpotSlotGenerator
class UAIHotSpotSlotGenerator : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAIHotSpotSlotGenerator* GetDefaultObj();

	class AAIHotSpot* GetHotSpot();
	void GenerateSlots();
	class UAIHotSpotSlot* AddSlot(struct FVector& RelativeLocation, struct FRotator& RelativeRotation, TSubclassOf<class UAIHotSpotSlot> CustomSlotClass, bool bEnabled);
};

// 0x48 (0x70 - 0x28)
// Class FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox
class UAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator
{
public:
	TSubclassOf<class UAIHotSpotSlot>            SlotClass;                                         // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MaxExtent;                                         // 0x30(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExpandBy;                                          // 0x3C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OffsetFromEdge;                                    // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Spacing;                                           // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLimitMaxExtent : 1;                               // Mask: 0x1, PropSize: 0x10x48(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMustHitFocusActor : 1;                            // Mask: 0x2, PropSize: 0x10x48(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_E : 6;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_114[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EBoundingBoxSlotDirectionCalculation SlotDirectionCalculation;                          // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115[0x23];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotSlotGenerator_OnBoundingBox* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class FortniteGame.FortAIHotSpotSlotGenerator_OnBoundingBox
class UFortAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator_OnBoundingBox
{
public:
	float                                        DistanceForRangedSlots;                            // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceForHugeSlots;                              // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortAIHotSpotSlotGenerator_OnBoundingBox* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortAIHotSpotSlotGenerator_FromConfig
class UFortAIHotSpotSlotGenerator_FromConfig : public UAIHotSpotSlotGenerator
{
public:
	class UAIHotSpotConfig*                      BuildingConfig;                                    // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Offset;                                            // 0x30(0xC)(Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorX : 1;                                      // Mask: 0x1, PropSize: 0x10x3C(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorY : 1;                                      // Mask: 0x2, PropSize: 0x10x3C(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAIHotSpotSlotGenerator_FromConfig* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.FortAIHotSpotSlotGenerator_RampTrace
class UFortAIHotSpotSlotGenerator_RampTrace : public UAIHotSpotSlotGenerator
{
public:
	uint8                                        Pad_117[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAIHotSpotSlotGenerator_RampTrace* GetDefaultObj();

};

// 0x88 (0xB0 - 0x28)
// Class FortniteGame.AutomationPerfMonitorManager
class UAutomationPerfMonitorManager : public UObject
{
public:
	uint8                                        Pad_119[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        DesiredStats;                                      // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bRecording;                                        // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11A[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeSinceLastRecord;                               // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastGoodFrame;                                     // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B[0x58];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAutomationPerfMonitorManager* GetDefaultObj();

	void StopRecordingFTestPerf();
	void StartRecordingFTestPerf(const TArray<class FString>& StatsToRecord);
	bool IsRecordingFTestPerf();
	float GetStatAverage(const class FString& StatName);
	class UAutomationPerfMonitorManager* GetPerfMonitorInstance();
};

// 0x28 (0x50 - 0x28)
// Class FortniteGame.FortAbilitySet
class UFortAbilitySet : public UPrimaryDataAsset
{
public:
	uint8                                        Pad_11C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UFortGameplayAbility>> GameplayAbilities;                                 // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FGameplayEffectApplicationInfo> PassiveGameplayEffects;                            // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAbilitySet* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortDamageSourceInterface
class IFortDamageSourceInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortDamageSourceInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortTargetSelectionInterface
class IFortTargetSelectionInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortTargetSelectionInterface* GetDefaultObj();

	struct FTransform GetTargetingTransform(enum class EFortAbilityTargetingSource Source, class UFortGameplayAbility* SourceAbility);
};

// 0x108 (0x840 - 0x738)
// Class FortniteGame.BuildingGameplayActor
class ABuildingGameplayActor : public ABuildingActor
{
public:
	uint8                                        Pad_121[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAbilitySet*                       AbilitySet;                                        // 0x748(0x8)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAbilitySet*                       InherentAbilitySets[0x5];                          // 0x750(0x28)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortDamageSet*                        DamageSet;                                         // 0x778(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   DamageStatHandle;                                  // 0x780(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bIgnoreInstigatorCollision;                        // 0x790(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAddOwnerVelocity;                                 // 0x791(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_122[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AbilitySourceLevel;                                // 0x794(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_123[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBuildingGameplayActorAbilityDeliveryInfo DeliverableAbilityInfo;                            // 0x7A0(0x80)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        bApplyDefaultEnabledAbilityBucketsOnInit : 1;      // Mask: 0x1, PropSize: 0x10x820(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseSimpleActorTouchSetupForAbilityBuckets : 1;    // Mask: 0x2, PropSize: 0x10x820(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F : 6;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_124[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   RegisteredTouchComponent;                          // 0x828(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_125[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UProjectileMovementComponent*          ProjectileMovementComponent;                       // 0x838(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ABuildingGameplayActor* GetDefaultObj();

	void SetTouchComponentForAbilityDeliveryInfo(class UPrimitiveComponent* PrimitiveComponent);
	void SetInitialVelocity(struct FVector& InitialVelocity);
	void SetIgnoreInstigatorCollision(bool bShouldIgnore);
	void SetAbilitySourceLevel(int32 NewAbilitySourceLevel);
	void OnRegisteredTouchComponentEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnRegisteredTouchComponentBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	struct FTransform GetTargetingSourceTransform(enum class EFortAbilityTargetingSource Source);
	void EnableAbilityDeliveryInfo(const struct FGameplayTag& BucketTag);
	void DisableAbilityDeliveryInfo(const struct FGameplayTag& BucketTag);
};

// 0xA0 (0x8E0 - 0x840)
// Class FortniteGame.BuildingCapturePointActor
class ABuildingCapturePointActor : public ABuildingGameplayActor
{
public:
	uint8                                        bUseHUDIndicator : 1;                              // Mask: 0x1, PropSize: 0x10x840(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_10 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_128[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  HUDStyle;                                          // 0x848(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               HUDOffset;                                         // 0x850(0xC)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHUDClampToScreenEdge : 1;                         // Mask: 0x1, PropSize: 0x10x85C(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_11 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_129[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USphereComponent*                      CollisionComponent;                                // 0x868(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bActivated : 1;                                    // Mask: 0x1, PropSize: 0x10x870(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_12 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_12A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EContentionRules                  ContentionRules;                                   // 0x874(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EFortTeam>                 TeamsBarredFromCapture;                            // 0x878(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        PercentIncreasePerPlayerCaptor;                    // 0x888(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PercentIncreasePerAICaptor;                        // 0x88C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PercentDecreaseNoCaptor;                           // 0x890(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLocked : 1;                                       // Mask: 0x1, PropSize: 0x10x894(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_13 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_12C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UnlockInterval;                                    // 0x898(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EUnlockRules                      UnlockRules;                                       // 0x89C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumCapturingPoint;                                 // 0x8A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamCapturingPoint;                                // 0x8A4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamControllingPoint;                              // 0x8A5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamOwningPoint;                                   // 0x8A6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECaptureState                     CaptureState;                                      // 0x8A7(0x1)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CapturePercentage;                                 // 0x8A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReplicatedCapturePercentage;                       // 0x8AC(0x4)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnCapturePointStateChanged;                        // 0x8B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnTeamOwningPointChanges;                          // 0x8C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_12E[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingCapturePointActor* GetDefaultObj();

	void SetActivatedState(bool bInActivated);
	void OnRep_ReplicatedCapturePercentage();
	void OnRep_CaptureState();
	void OnRep_bLocked();
	void OnRep_bActivated();
	void OnLeaveCapturePoint(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnEnterCapturePoint(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnCapturePointStateChange(enum class ECaptureState InState, enum class EFortTeam InTeam);
	void OnCapturePointLockStateChange(bool bInLocked);
	void OnCapturePointActiveStateChange(bool bInActive);
	enum class ECaptureState GetCaptureState();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortCarriedObjectHolderInterface
class IFortCarriedObjectHolderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortCarriedObjectHolderInterface* GetDefaultObj();

	void OnCarriedObjectDetach(class AActor* DetachedObject);
	void OnCarriedObjectAttach(class AActor* AttachedObject);
	void GetCarriedObjectAttachmentInfo(struct FCarriedObjectAttachmentInfo* OutAttachInfo);
	class USceneComponent* GetAttachmentComponent(class FName SocketName);
	bool CanHoldObject(class AActor* CarriableObject);
};

// 0x60 (0x8A0 - 0x840)
// Class FortniteGame.BuildingFlagSpawn
class ABuildingFlagSpawn : public ABuildingGameplayActor
{
public:
	uint8                                        Pad_130[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               HUDIndicatorRelativeOffset;                        // 0x848(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPickupOnTouch;                                    // 0x854(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_131[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AFortCarriedObject>        CarriedObjectClass;                                // 0x858(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeTranslation;                               // 0x860(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_132[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortCarriedObject*                    SpawnedObject;                                     // 0x870(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpawnDelay;                                        // 0x878(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_133[0x24];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingFlagSpawn* GetDefaultObj();

	void SpawnCarriedObject();
	void OnCarriedObjectDetachedEvent();
	void OnCarriedObjectAttachedEvent();
	bool IsSpawnedObjectAwayFromBase();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortItemTypeFunctionLibrary
class UFortItemTypeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFortItemTypeFunctionLibrary* GetDefaultObj();

	class FText ToText(enum class EFortItemType ItemType, bool UsePlural);
};

// 0xA8 (0xD0 - 0x28)
// Class FortniteGame.FortGenericRecord
class UFortGenericRecord : public UObject
{
public:
	uint8                                        Pad_135[0xA8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortGenericRecord* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortTooltipInterface
class IFortTooltipInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortTooltipInterface* GetDefaultObj();

	TSubclassOf<class UFortTooltip> GetTooltip();
	class UFortTooltipDisplayStatsList* GetDisplayStats();
};

// 0x40 (0x68 - 0x28)
// Class FortniteGame.FortTooltipContext
class UFortTooltipContext : public UObject
{
public:
	class UAbilitySystemComponent*               SourceAbilitySystem;                               // 0x28(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*               DestAbilitySystem;                                 // 0x30(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TreatAsLevel;                                      // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_136[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 TagContainer;                                      // 0x40(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UObject*                               ComparisonObject;                                  // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortTooltipContext* GetDefaultObj();

	class UFortTooltipContext* SpawnTooltipContextWithSource(class APlayerController* SourcePlayerController);
	class UFortTooltipContext* SpawnTooltipContextWithNetID(class UObject* WorldContextObject, struct FUniqueNetIdRepl& UniqueId);
	class UFortTooltipContext* SpawnTooltipContext();
};

// 0x60 (0x88 - 0x28)
// Class FortniteGame.FortTooltipMap
class UFortTooltipMap : public UDataAsset
{
public:
	uint8                                        Pad_137[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortTooltipMapEntry>          Mapping;                                           // 0x78(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortTooltipMap* GetDefaultObj();

};

// 0x58 (0x80 - 0x28)
// Class FortniteGame.FortTooltipManager
class UFortTooltipManager : public UObject
{
public:
	TMap<class UClass*, class UFortTooltip*>     Tooltips;                                          // 0x28(0x50)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                DamageRecieverProxy;                               // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortTooltipManager* GetDefaultObj();

};

// 0x68 (0x90 - 0x28)
// Class FortniteGame.FortTooltip
class UFortTooltip : public UObject
{
public:
	class FText                                  Description;                                       // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_142[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortTooltip* GetDefaultObj();

	void SetLocalizationText(const class FString& Name, class FText Value);
	void SetLocalizationInt(const class FString& Name, int32 Value);
	void SetLocalizationFloat(const class FString& Name, float Value);
	bool GetValueData(class UObject* ObjectToDescribe, class UFortTooltipContext* Context, struct FGameplayTag& Token, struct FFortTooltipValueData* OutData);
	bool GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
	bool BP_GetValueData(class UObject* ObjectToDescribe, class UFortTooltipContext* Context, struct FGameplayTag& Token, struct FFortTooltipValueData* OutData);
	bool BP_GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool BP_GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool BP_GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.FortTooltipDisplayStatsList
class UFortTooltipDisplayStatsList : public UDataAsset
{
public:
	TArray<struct FFortTooltipDisplayStatsCategory> TooltipCategories;                                 // 0x28(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortTooltipDisplayStatsList* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class FortniteGame.FortTooltipDisplayStatsLookupTable
class UFortTooltipDisplayStatsLookupTable : public UDataAsset
{
public:
	TArray<struct FFortTooltipDisplayInfo>       TooltipDisplayStats;                               // 0x28(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_143[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortTooltipDisplayStatsLookupTable* GetDefaultObj();

};

// 0x1F8 (0x220 - 0x28)
// Class FortniteGame.FortItemDefinition
class UFortItemDefinition : public UMcpItemDefinitionBase
{
public:
	uint8                                        Pad_147[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemCountChanged;                                // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EFortItemType                     ItemType;                                          // 0x48(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_148[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MinLevel;                                          // 0x4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxLevel;                                          // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_149[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  DisplayName;                                       // 0x58(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	class FText                                  ShortDescription;                                  // 0x70(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  Description;                                       // 0x88(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  DisplayNamePrefix;                                 // 0xA0(0x18)(Protected, NativeAccessSpecifierProtected)
	class FText                                  SearchTags;                                        // 0xB8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 GameplayTags;                                      // 0xD0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	enum class EFortInventoryFilter              FilterOverride;                                    // 0xF0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsAccountItem : 1;                                // Mask: 0x1, PropSize: 0x10xF4(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeverPersisted : 1;                               // Mask: 0x2, PropSize: 0x10xF4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_14 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_14B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 SecondaryCategoryOverrideTags;                     // 0xF8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 TertiaryCategoryOverrideTags;                      // 0x118(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                        bAllowMultipleStacks : 1;                          // Mask: 0x1, PropSize: 0x10x138(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_15 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_14C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxStackSize;                                      // 0x13C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPrivateTemplate;                                  // 0x140(0x1)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInventorySizeLimited;                             // 0x141(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTemplateAccess               Access;                                            // 0x142(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCalculateRarityFromQualityAndTier;                // 0x143(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortQuality                      Quality;                                           // 0x144(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemTier                     Tier;                                              // 0x145(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemTier                     MaxTier;                                           // 0x146(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14D[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UFortTooltip>            TooltipClass;                                      // 0x148(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortTooltipDisplayStatsList> StatList;                                          // 0x168(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  RatingLookup;                                      // 0x188(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UTexture2D*                            SmallPreviewImage;                                 // 0x198(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             LargePreviewImage;                                 // 0x1A0(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortRarity                       Rarity;                                            // 0x1C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14E[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            FrontendPreviewMeshOffset;                         // 0x1D0(0x30)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UStaticMesh>            FrontendPreviewMeshOverride;                       // 0x200(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortItemDefinition* GetDefaultObj();

	bool IsInventorySizeLimited();
	TSubclassOf<class UFortTooltip> GetTooltip();
	struct FSlateBrush GetSmallPreviewImageBrush();
	TSoftObjectPtr<class UTexture2D> GetSmallPreviewImage();
	class FText GetSingleLineDescription();
	class FText GetShortDescription();
	bool GetPreviewStaticMeshAsset(TSoftObjectPtr<class UStaticMesh>* Asset);
	bool GetPreviewSkeletalMeshAsset(TSoftObjectPtr<class USkeletalMesh>* Asset);
	struct FTransform GetPreviewMeshOffset();
	class FString GetPersistentName();
	TSoftObjectPtr<class UTexture2D> GetLargePreviewImage();
	class UFortTooltipDisplayStatsList* GetDisplayStats();
	class FText GetDisplayName(bool bBaseName);
	TArray<class FText> GetDescription();
	class UFortItem* CreateTemporaryItemInstanceBP(int32 Count, int32 Level);
	class UFortItem* CreateTemporaryInstanceFromExistingItemBP(class UFortItem* ExistingItem, int32 Count, int32 Level);
};

// 0x120 (0x148 - 0x28)
// Class FortniteGame.FortItemIconDefinition
class UFortItemIconDefinition : public UDataAsset
{
public:
	struct FSlateBrush                           Brush;                                             // 0x28(0x90)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                           LargeBrush;                                        // 0xB8(0x90)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortItemIconDefinition* GetDefaultObj();

};

// 0xA8 (0xD0 - 0x28)
// Class FortniteGame.FortItem
class UFortItem : public UObject
{
public:
	uint8                                        Pad_15E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemChanged;                                     // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemDestroyed;                                   // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_160[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bLoadedFromSave : 1;                               // Mask: 0x1, PropSize: 0x10xC8(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTemporaryItemOwningController : 1;                // Mask: 0x2, PropSize: 0x10xC8(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_161[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItem* GetDefaultObj();

	bool TryGetCategory(enum class EFortItemCategoryOrdinal Ordinal, class FText* OutCategoryDisplayName, bool* OutHasIcon, struct FFortMultiSizeBrush* OutCategoryIconBrush);
	void SetOwningControllerForTemporaryItem(class AFortPlayerController* InController);
	bool IsTemporaryItem();
	bool IsSlotted();
	bool IsSchematic();
	bool IsInventoryOverflowItem();
	bool IsInStorageVault();
	bool IsEquipped();
	bool IsEquipable(class AFortPlayerController* EquippingPC);
	bool IsAlterationSlotActive(int32 SlotIndex);
	bool IsActivatable(class AFortPlayerController* FortPC, struct FGameplayTagContainer* FailureReason);
	bool HasEvolutions();
	bool HasDurability();
	class FText GetUpgradeRestrictionReasonText(enum class EItemUpgradeRestrictionReason Reason);
	class UFortPersistentResourceItemDefinition* GetUpgradeResourceItemDefinition();
	int32 GetUpgradeCost();
	enum class EFortItemType GetType();
	enum class EFortItemTier GetTier();
	bool GetTertiaryCategory(class FText* ItemCategoryText, struct FSlateBrush* ItemCategoryBrush, enum class EFortBrushSize BrushSize);
	TSoftObjectPtr<class UTexture2D> GetSmallPreviewImage();
	bool GetSecondaryCategory(class FText* ItemCategoryText, struct FSlateBrush* ItemCategoryBrush, enum class EFortBrushSize BrushSize);
	class FText GetSearchTags();
	enum class EFortItemType GetSchematicResultType();
	class UFortItemDefinition* GetSchematicCraftingResultBP();
	int32 GetRemainingAmmo();
	int32 GetRecycleValue();
	int32 GetRating();
	struct FLinearColor GetRaritySecondaryColor();
	struct FLinearColor GetRarityColor();
	enum class EFortRarity GetRarity();
	bool GetPrimaryCategory(class FText* ItemCategoryText);
	class AFortPlayerController* GetOwningController();
	int32 GetNumInStack();
	float GetNormalizedDurability();
	enum class EFortItemTier GetMaxTier();
	int32 GetMaxLevel();
	int32 GetLoadedAmmo();
	int32 GetLevel();
	TSoftObjectPtr<class UTexture2D> GetLargePreviewImage();
	struct FGuid GetItemGuid();
	class UFortItemDefinition* GetItemDefinitionBP();
	enum class EFortInventoryFilter GetFilterCategory();
	class FText GetEvolveRestrictionReasonText(enum class EItemEvolutionRestrictionReason Reason);
	float GetDurability();
	class FText GetDisplayName();
	class FText GetDescription();
	float GetCoolDownTimeRemaining(class AFortPlayerController* FortPC, float* CooldownDuration);
	class FText GetAlterationSlotActivationRequirement(int32 SlotIndex);
	TArray<class UFortAlterationItemDefinition*> GetAlterations();
	bool DoesMatchSearchString(const class FString& SearchString);
	bool CanEvolve(TArray<enum class EItemEvolutionRestrictionReason>* OutRestrictionReasons);
	bool CanBeUpgraded(TArray<enum class EItemUpgradeRestrictionReason>* OutRestrictionReasons);
	bool CanBeUnslotted();
	bool CanBeDropped();
};

// 0x40 (0x3C8 - 0x388)
// Class FortniteGame.FortPickupEffect
class AFortPickupEffect : public AActor
{
public:
	class UStaticMesh*                           StaticMesh;                                        // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x390(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*              ItemDefinition;                                    // 0x398(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDoNotShowSpawnParticles;                          // 0x3A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_162[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               PickupColor;                                       // 0x3A4(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          BackpackWorldPosition;                             // 0x3B0(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOwnedByALocalPlayer : 1;                          // Mask: 0x1, PropSize: 0x10x3C0(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOwnedByPlayer : 1;                                // Mask: 0x2, PropSize: 0x10x3C0(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_163[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortPickupEffect* GetDefaultObj();

	void OnTossed();
	void OnPickedUp();
	void OnAttached();
	void OnAboutToEnterBackpack(class AFortPawn* PickupTarget);
};

// 0x200 (0x420 - 0x220)
// Class FortniteGame.FortWorldItemDefinition
class UFortWorldItemDefinition : public UFortItemDefinition
{
public:
	struct FGameplayTagContainer                 RequiredEquipTags;                                 // 0x220(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 OverrideAutoEquipTags;                             // 0x240(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bCanAutoEquipByClass;                              // 0x260(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_165[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bSupportsQuickbarFocus : 1;                        // Mask: 0x1, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldShowItemToast : 1;                          // Mask: 0x2, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowDirectionalArrowWhenFarOff : 1;               // Mask: 0x4, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeDropped : 1;                                 // Mask: 0x8, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bItemCanBeStolen : 1;                              // Mask: 0x10, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeDepositedInStorageVault : 1;                 // Mask: 0x20, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bItemHasDurability : 1;                            // Mask: 0x40, PropSize: 0x10x264(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_16 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_166[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DropCount;                                         // 0x268(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortReplicatedStat               AccumulatingStatType;                              // 0x26C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_167[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           MiniMapIconBrush;                                  // 0x270(0x90)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                        MiniMapViewableDistance;                           // 0x300(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_168[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OwnerPickupText;                                   // 0x308(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDataTableCategoryHandle              LootLevelData;                                     // 0x320(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_169[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            PickupMeshTransform;                               // 0x340(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        bOverridePickupMeshTransform : 1;                  // Mask: 0x1, PropSize: 0x10x370(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDropOnDeath : 1;                                  // Mask: 0x2, PropSize: 0x10x370(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDropOnLogout : 1;                                 // Mask: 0x4, PropSize: 0x10x370(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_17 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_16A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UStaticMesh>            PickupStaticMesh;                                  // 0x378(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USkeletalMesh>          PickupSkeletalMesh;                                // 0x398(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             PickupSound;                                       // 0x3B8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             DropSound;                                         // 0x3D8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DisassembleRecipe;                                 // 0x3F8(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        DisassembleDurabilityDegradeMinLootPercent;        // 0x408(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DisassembleDurabilityDegradeMaxLootPercent;        // 0x40C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasDisintegrationValue;                           // 0x410(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUsesCraftingRecipeToGetDisintegrationValue;       // 0x411(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16B[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FabricationValueOverride;                          // 0x414(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreferredQuickbarSlot;                             // 0x418(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16C[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortWorldItemDefinition* GetDefaultObj();

	float GetMaxDurability(int32 ItemLevel);
	int32 GetFabricationValue(bool bUseDisintegrationOverride);
	float GetDPSAtLevel(int32 ItemLevel);
	class UFortWorldItemDefinition* GetAmmoWorldItemDefinition_BP();
	bool CanBeDisassembled();
};

// 0x328 (0x6B0 - 0x388)
// Class FortniteGame.FortQuickBars
class AFortQuickBars : public AActor
{
public:
	struct FQuickBar                             PrimaryQuickBar;                                   // 0x388(0x90)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FQuickBar                             SecondaryQuickBar;                                 // 0x418(0x90)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                        Pad_176[0x1C8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortWorldItem*>                CachedFloorTraps;                                  // 0x670(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UFortWorldItem*>                CachedWallTraps;                                   // 0x680(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UFortWorldItem*>                CachedCeilingTraps;                                // 0x690(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_177[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortQuickBars* GetDefaultObj();

	void ServerSwapItemsInternal(enum class EFortQuickBars QuickBarA, int32 SlotIndexA, enum class EFortQuickBars QuickBarB, int32 SlotIndexB);
	void ServerRemoveItemInternal(const struct FGuid& Item, bool bFindReplacement, bool bForce);
	void ServerAddItemInternal(const struct FGuid& Item, enum class EFortQuickBars InQuickBar, int32 Slot);
	void ServerActivateSlotInternal(enum class EFortQuickBars InQuickBar, int32 Slot, float ActivateDelay, bool bUpdatePreviousFocusedSlot);
	void OnRep_SecondaryQuickBar();
	void OnRep_PrimaryQuickBar();
	void EnableSlot(enum class EFortQuickBars InQuickBar, int32 SlotIndex);
	void EmptySlot(enum class EFortQuickBars InQuickBar, int32 SlotIndex);
	void Empty(enum class EFortQuickBars InQuickBar);
	void DisableSlot(enum class EFortQuickBars InQuickBar, int32 SlotIndex);
};

// 0x0 (0x220 - 0x220)
// Class FortniteGame.FortMetadataItemDefinition
class UFortMetadataItemDefinition : public UFortItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UFortMetadataItemDefinition* GetDefaultObj();

};

// 0x8 (0x228 - 0x220)
// Class FortniteGame.FortCloudSaveItemDefinition
class UFortCloudSaveItemDefinition : public UFortMetadataItemDefinition
{
public:
	int32                                        ContentVersion;                                    // 0x220(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_178[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortCloudSaveItemDefinition* GetDefaultObj();

};

// 0x148 (0x218 - 0xD0)
// Class FortniteGame.FortWorldRecord
class UFortWorldRecord : public UFortGenericRecord
{
public:
	struct FFortCloudSaveInfo                    CloudInfo;                                         // 0xD0(0x18)(Transient, NativeAccessSpecifierPublic)
	int32                                        CurrentZoneIndex;                                  // 0xE8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_179[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortPlayerRecord>             SavedPlayers;                                      // 0xF0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FFortZoneInstanceDetails              ZoneInstanceInfo;                                  // 0x100(0x108)(Transient, NativeAccessSpecifierPublic)
	class FString                                WUID;                                              // 0x208(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortWorldRecord* GetDefaultObj();

};

// 0x1D0 (0x2A0 - 0xD0)
// Class FortniteGame.FortZoneRecord
class UFortZoneRecord : public UFortGenericRecord
{
public:
	int32                                        WorldSaveCount;                                    // 0xD0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ZoneIndex;                                         // 0xD4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PersistentLevelName;                               // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortLevelRecord>              SavedLevels;                                       // 0xE0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NumSavedLevels;                                    // 0xF0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ZoneTileSeed;                                      // 0xF4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A[0x190];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStatManagerPeriodRecord>      PlayerMapStatManagerPeriods;                       // 0x288(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        CloudSaveItemDefContentVersion;                    // 0x298(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNeedsFullActorSave;                               // 0x29C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortZoneRecord* GetDefaultObj();

};

// 0xB0 (0xD8 - 0x28)
// Class FortniteGame.FortBuildingInstructions
class UFortBuildingInstructions : public UDataAsset
{
public:
	TSoftObjectPtr<class UWorld>                 TemplateMap;                                       // 0x28(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortBuildingInstruction>      Instructions;                                      // 0x48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                      Bounds;                                            // 0x58(0x1C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        NumOfPiecesToSpawnAtOnce;                          // 0x74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeBetweenSpawns;                                 // 0x78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MapName;                                           // 0x80(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17D[0x48];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortBuildingInstructions* GetDefaultObj();

};

// 0x0 (0x840 - 0x840)
// Class FortniteGame.BuildingFOBCoreSpawnPad
class ABuildingFOBCoreSpawnPad : public ABuildingGameplayActor
{
public:

	static class UClass* StaticClass();
	static class ABuildingFOBCoreSpawnPad* GetDefaultObj();

	struct FTransform GetCoreSpawnTransform();
};

// 0x2F0 (0xB30 - 0x840)
// Class FortniteGame.BuildingFOBConfigActor
class ABuildingFOBConfigActor : public ABuildingGameplayActor
{
public:
	UMulticastDelegateProperty_                  OnIOOperationComplete;                             // 0x840(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                ExplicitSaveFile;                                  // 0x850(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortBuildingInstructions> FallbackBuildingInstructions;                      // 0x860(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                CoreSaveFileUniqueContext;                         // 0x880(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class ABuildingFOBCoreSpawnPad> CreationModeSpawnPadClass;                         // 0x890(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 SpawnPadPlacementActorRequiredTags;                // 0x8B0(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObjectLibrary>         FOBCoreLibrary;                                    // 0x8D0(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLoadFirstCoreInCreationMode : 1;                  // Mask: 0x1, PropSize: 0x10x8F0(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_18 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_182[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFOBCoreChoiceArray                   FOBCoreChoices;                                    // 0x8F8(0xC0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortFOBCoreDecoItemDefinition*        SelectedCoreItemDef;                               // 0x9B8(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingFOBCoreActor*                 SelectedCore;                                      // 0x9C0(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingFOBCoreSpawnPad*              CoreSpawnPad;                                      // 0x9C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFOBSaveFileBuildingInstructionsHandler* SaveFileInstructionsHandler;                       // 0x9D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUniqueNetIdRepl                      OwnerNetID;                                        // 0x9D8(0x18)(Net, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFOBMode                          FOBMode;                                           // 0x9F0(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFOBIOStatus                      IOStatus;                                          // 0x9F1(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_183[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnumeratedUserFilesSuccessfully : 1;              // Mask: 0x1, PropSize: 0x10x9F4(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCoreBasedDeploymentModeFinalizationRequested : 1; // Mask: 0x2, PropSize: 0x10x9F4(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInitialized : 1;                                  // Mask: 0x4, PropSize: 0x10x9F4(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bFinalized : 1;                                    // Mask: 0x8, PropSize: 0x10x9F4(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDummyDeployment : 1;                              // Mask: 0x10, PropSize: 0x10x9F4(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_19 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_184[0xE3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnAllBuildingsSpawned;                             // 0xAD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UBoxComponent*                         ContainmentBoxComponent;                           // 0xAE8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                  ContainmentBoxStructuralGridBox;                   // 0xAF0(0x1C)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_185[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 SpawnLocationTags;                                 // 0xB10(0x20)(Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingFOBConfigActor* GetDefaultObj();

	bool ReloadFOB();
	void OnRep_FOBMode();
	void OnRep_bFinalized();
	void OnIOOperationCompleteMulticast(enum class EFOBIOStatus IOOperation, bool bSuccess, class UFortFOBCoreDecoItemDefinition* SelectedCoreDef);
	void OnFOBModeSet(enum class EFOBMode ModeThatWasSet);
	void OnFinalized();
	void OnFinalizationPlayFX();
	void OnFinalizationFXMulticast();
	void OnCoreInitialized(class ABuildingFOBCoreActor* InitializedCore);
	bool IsPlayerControllerFOBOwner(class AFortPlayerController* FortPC);
	bool IsInitialized();
	bool IsFinalized();
	bool IsBuildingActorWithinFOB(class ABuildingActor* ActorToCheck);
	class UFortFOBCoreDecoItemDefinition* GetSelectedFOBCoreItemDefinition();
	enum class EFOBMode GetFOBMode();
	TArray<struct FFOBCoreChoice> GetAllCoreChoices();
	bool CanSaveFOB();
	bool CanReloadFOB();
	bool CanPerformIOOperation();
	bool AttemptSelectFOBCore(class UFortFOBCoreDecoItemDefinition* DefToSelect);
};

// 0x110 (0x950 - 0x840)
// Class FortniteGame.BuildingFOBCoreActor
class ABuildingFOBCoreActor : public ABuildingGameplayActor
{
public:
	TSoftObjectPtr<class UParticleSystem>        SimpleDeathParticles;                              // 0x840(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             SimpleDeathSound;                                  // 0x860(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         SimpleBoundsBoxComponent;                          // 0x880(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         TouchBoxComponent;                                 // 0x888(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               ContainmentVolumeTouchBoxOffsetExtents;            // 0x890(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisterAsGlobalGameplayEventListener : 1;        // Mask: 0x1, PropSize: 0x10x89C(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bConformTouchBoxToFOBContainmentBox : 1;           // Mask: 0x2, PropSize: 0x10x89C(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bActive : 1;                                       // Mask: 0x4, PropSize: 0x10x89C(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTargetable : 1;                                   // Mask: 0x8, PropSize: 0x10x89C(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bVulnerable : 1;                                   // Mask: 0x10, PropSize: 0x10x89C(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_1A : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_189[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnFOBCoreTargetableChanged;                        // 0x8A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnFOBCoreVulnerableChanged;                        // 0x8B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FUniqueNetIdRepl                      OwnerNetID;                                        // 0x8C0(0x18)(Net, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortFOBCoreDecoItemDefinition*        SpawnedFromItemDef;                                // 0x8D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingFOBCoreSpawnPad*              SpawnedFromSpawnPad;                               // 0x8E0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                  FOBBounds;                                         // 0x8E8(0x1C)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                  FOBStructuralBounds;                               // 0x904(0x1C)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnFOBCoreDamaged;                                  // 0x920(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnFOBCoreOutOfHealth;                              // 0x930(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        bShowTargetableHUDIndicator : 1;                   // Mask: 0x1, PropSize: 0x10x940(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_18A[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingFOBCoreActor* GetDefaultObj();

	void OnVulnerableStatusChanged(bool bNewTargetableStatus);
	void OnTargetableStatusChanged(bool bNewTargetableStatus);
	void OnRep_bVulnerable();
	void OnRep_bTargetable();
	void OnRep_bActive();
	void OnActiveStatusChanged(bool bNewActiveStatus);
	void MarkVulnerable();
	void MarkTargetable();
	bool IsActorWithinFOBBounds(class AActor* Actor);
	bool IsActive();
	struct FTransform GetSimpleDeathFXTransform();
	bool GetFOBBoundsCenterAndExtents(struct FVector* OutCenter, struct FVector* OutExtents);
	void GetFOBBoundsBoxOverlappedActors(TArray<class ABuildingSMActor*>* OverlappedActors, bool bSortByDistanceFromCore);
};

// 0xC0 (0x900 - 0x840)
// Class FortniteGame.BuildingItemCollectorActor
class ABuildingItemCollectorActor : public ABuildingGameplayActor
{
public:
	uint8                                        Pad_18F[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortItemCollectorBehavior        ItemCollectorBehavior;                             // 0x8B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemCollectorState           ItemCollectorState;                                // 0x8B1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         ControllingTeam;                                   // 0x8B2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_190[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortWorldItemDefinition*              ItemToDeposit;                                     // 0x8B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           MaxDepositCurve;                                   // 0x8C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                TeamDepositAmounts;                                // 0x8C8(0x10)(Edit, Net, ZeroConstructor, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                TeamDepositGoals;                                  // 0x8D8(0x10)(Edit, Net, ZeroConstructor, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_191[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingItemCollectorActor* GetDefaultObj();

	void UpdateTeamDepositValues(TArray<int32>& DepositAmounts, TArray<int32>& DepositGoals);
	void SetItemCollectorState(enum class EFortItemCollectorState InItemCollectorState);
	void OnTeamReachedDepositGoal(enum class EFortTeam InControllingTeam);
	void OnRep_TeamDepositGoals();
	void OnRep_TeamDepositAmounts();
	void OnRep_ItemCollectorState();
	void OnRep_ControllingTeam();
	void OnItemCollectorStateChanged(enum class EFortItemCollectorState InItemCollectorState);
	int32 GetTeamReachedGoalCount(enum class EFortTeam InTeam);
	int32 GetTeamDepositGoal(enum class EFortTeam InTeam);
	int32 GetTeamDepositAmount(enum class EFortTeam InTeam);
	int32 GetNumberOfTeamCaptures(enum class EFortTeam InTeam);
};

// 0x10 (0x850 - 0x840)
// Class FortniteGame.DecoyActor
class ADecoyActor : public ABuildingGameplayActor
{
public:
	float                                        GoalOverrideRadius;                                // 0x840(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_192[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADecoyActor* GetDefaultObj();

};

// 0x50 (0x890 - 0x840)
// Class FortniteGame.DeployableBaseCore
class ADeployableBaseCore : public ABuildingGameplayActor
{
public:
	class ADeployableBasePlot*                   Plot;                                              // 0x840(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UParticleSystem>        SimpleDeathParticles;                              // 0x848(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             SimpleDeathSound;                                  // 0x868(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisterAsGlobalGameplayEventListener : 1;        // Mask: 0x1, PropSize: 0x10x888(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_193[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADeployableBaseCore* GetDefaultObj();

	struct FTransform GetSimpleDeathFXTransform();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortInventoryOwnerInterface
class IFortInventoryOwnerInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortInventoryOwnerInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortInventoryInterface
class IFortInventoryInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortInventoryInterface* GetDefaultObj();

};

// 0x200 (0x588 - 0x388)
// Class FortniteGame.FortInventory
class AFortInventory : public AActor
{
public:
	uint8                                        Pad_194[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortInventoryType                InventoryType;                                     // 0x390(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bEnforcesMaxNumStackRules;                         // 0x391(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_195[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayAttribute                    InventoryMaxSizeAttribute;                         // 0x398(0x20)(Net, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAccountItemDefinition*            InventoryMaxSizeToken;                             // 0x3B8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortItemList                         Inventory;                                         // 0x3C0(0x170)(Net, SaveGame, RepNotify, NativeAccessSpecifierPrivate)
	bool                                         bRequiresLocalUpdate;                              // 0x530(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRequiresSaving;                                   // 0x531(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsShuttingDown;                                   // 0x532(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_196[0x15];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortWorldItem*>                PendingInstances;                                  // 0x548(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UFortItem*>                     RecentlyAdded;                                     // 0x558(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UFortItem*>                     RecentlyRemoved;                                   // 0x568(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UFortItem*>                     RecentlyChanged;                                   // 0x578(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AFortInventory* GetDefaultObj();

	void HandleInventoryLocalUpdate();
	void HandleInventoryAttributeChange();
};

// 0x2C0 (0xB00 - 0x840)
// Class FortniteGame.DeployableBasePlot
class ADeployableBasePlot : public ABuildingGameplayActor
{
public:
	uint8                                        Pad_199[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUniqueNetIdRepl                      OccupantNetID;                                     // 0x848(0x18)(Net, Transient, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortCloudSaveInfo                    OccupantNextCloudSaveInfo;                         // 0x860(0x18)(Transient, Protected, NativeAccessSpecifierProtected)
	class UFortDeployableBaseRecord*             OccupantDeployableBaseRecord;                      // 0x878(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         BuildableSpaceComponent;                           // 0x880(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         SavableSpaceComponent;                             // 0x888(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         EntirePlotSpaceComponent;                          // 0x890(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                       SpawnOffsetComponent;                              // 0x898(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         BuildableAreasArray[0x3];                          // 0x8A0(0x18)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class ADeployableBaseCore>     DeployableBaseCoreClass;                           // 0x8B8(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADeployableBaseCore*                   DeployableBaseCore;                                // 0x8D8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDirty : 1;                                        // Mask: 0x1, PropSize: 0x10x8E0(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDirtiedSinceLastWriteToBuffer : 1;                // Mask: 0x2, PropSize: 0x10x8E0(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCloudFileSavedSinceLastCloudItemUpdate : 1;       // Mask: 0x4, PropSize: 0x10x8E0(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_1B : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_19A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EDeployableBaseBuildingState      CurrentBuildingState;                              // 0x8E4(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EDeployableBaseBuildingState      GoalBuildingState;                                 // 0x8E5(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19B[0x4A];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnOccupantIdChanged;                               // 0x930(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnDeployableBaseCoreCreated;                       // 0x940(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnDeployableBaseCoreDestroyed;                     // 0x950(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnDeployableBasePlotSpacesChanged;                 // 0x960(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<class AFortDeployableBasePickup*>     OutstandingAssociatedPickups;                      // 0x970(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AFortInventory*                        PlotInventory;                                     // 0x980(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19C[0x78];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DeferredActorIdxToResumeAt;                        // 0xA00(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumActorsFromRecordDestroyed;                      // 0xA04(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntVector                            BuildableSpaceExpansionVector;                     // 0xA08(0xC)(Net, Transient, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxActorsToCreatePerBuildingCall;                  // 0xA14(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxActorsToDestroyPerDestroyCall;                  // 0xA18(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DelayBetweenActorRecordBuilding;                   // 0xA1C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DelayBetweenActorRecordDestroying;                 // 0xA20(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerStart*                      PlayerStart;                                       // 0xA28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>           ConstructionTimeEffect;                            // 0xA30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDeferredActorData>            DeferredConstructionActors;                        // 0xA38(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_19E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBox                                  BuildableAreasStructuralSupportBoxesArray[0x3];    // 0xA50(0x54)(Net, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_19F[0x5C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADeployableBasePlot* GetDefaultObj();

	void OnRep_OccupantNetID();
	void OnRep_CurrentBuildingState();
	void OnRep_BuildableSpaceExpansionVector();
	void OnCurrentBuildingStateSet(enum class EDeployableBaseBuildingState InCurrentBuildingState);
	void OnBuildingStateTransition(enum class EDeployableBaseBuildingState InPreviousState, enum class EDeployableBaseBuildingState InCurrentState);
	bool IsOccupied();
	bool IsOccupant(struct FUniqueNetIdRepl& UserId);
	bool IsBuildingActorWithinBuildableSpace(class ABuildingActor* ActorToCheck, struct FVector& GridLocation);
	void HandleBuildingStateTransition(enum class EDeployableBaseBuildingState InPreviousState, enum class EDeployableBaseBuildingState InCurrentState);
	class AFortPlayerStart* GetPlayerStart();
	struct FUniqueNetIdRepl GetOccupantNetID();
	int32 GetNumOfItemsInPlot();
};

// 0x10 (0x850 - 0x840)
// Class FortniteGame.FortAthenaSupplyDrop
class AFortAthenaSupplyDrop : public ABuildingGameplayActor
{
public:
	struct FCollisionProfileName                 GroundCollsionProfile;                             // 0x840(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A1[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortAthenaSupplyDrop* GetDefaultObj();

	bool GroundTrace(struct FVector& TraceStart, struct FVector& TraceEnd, struct FHitResult* OutHit);
};

// 0x10 (0x850 - 0x840)
// Class FortniteGame.SBAGrantedBuildingGameplayActor
class ASBAGrantedBuildingGameplayActor : public ABuildingGameplayActor
{
public:
	struct FTeamStrategicBuildingHandle          OwningSBAHandle;                                   // 0x840(0x4)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A2[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASBAGrantedBuildingGameplayActor* GetDefaultObj();

	class AStrategicBuildingActor* GetOwnerStrategicBuildingActor();
};

// 0x28 (0x50 - 0x28)
// Class FortniteGame.FortIndicator
class UFortIndicator : public UObject
{
public:
	struct FVector                               RelativeLocation;                                  // 0x28(0xC)(Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistance;                                       // 0x34(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A4[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortIndicator* GetDefaultObj();

	void OnParentActorEndPlay(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
};

// 0x2C8 (0x318 - 0x50)
// Class FortniteGame.FortMiniMapIndicator
class UFortMiniMapIndicator : public UFortIndicator
{
public:
	uint8                                        Pad_1A5[0x2C1];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bForceHidden;                                      // 0x311(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A6[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortMiniMapIndicator* GetDefaultObj();

};

// 0x4B8 (0xA40 - 0x588)
// Class FortniteGame.FortGameplayAbility
class UFortGameplayAbility : public UGameplayAbility
{
public:
	uint8                                        Pad_1B4[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortGameplayAbilityActivation    ActivationType;                                    // 0x598(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortGameplayEffectContainer          EffectContainers[0x5];                             // 0x5A0(0x2A8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortGameplayEffectContainer>  GameplayEffectContainers;                          // 0x848(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 OwnerPreviewImageOverrideTags;                     // 0x858(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortProjectileBase>       ProjectileClass;                                   // 0x878(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   DamageStatHandle;                                  // 0x880(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FFortAbilityCost>              AbilityCosts;                                      // 0x890(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        bShowWidgetForCosts : 1;                           // Mask: 0x1, PropSize: 0x10x8A0(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStartWithCooldown : 1;                            // Mask: 0x2, PropSize: 0x10x8A0(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPersistOnDeath : 1;                               // Mask: 0x4, PropSize: 0x10x8A0(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopsAIBehaviorLogic : 1;                         // Mask: 0x8, PropSize: 0x10x8A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopsAIMovement : 1;                              // Mask: 0x10, PropSize: 0x10x8A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopsRVOAvoidance : 1;                            // Mask: 0x20, PropSize: 0x10x8A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceNormalAILOD : 1;                             // Mask: 0x40, PropSize: 0x10x8A0(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1C : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1B6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortAILODLevel                   MinimumRequiredAILODLevel;                         // 0x8A4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B7[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_1D : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bRelevantForAIDespawning : 1;                      // Mask: 0x8, PropSize: 0x10x8A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseAIFireLocationAndRotation : 1;                 // Mask: 0x10, PropSize: 0x10x8A8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1E : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1B8[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortAIWeaponUsage                AIWeaponUsage;                                     // 0x8AC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          WeaponTestApplicationTag;                          // 0x8B0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVerifyFireOffsetIsNotObstructedByWorldGeometry : 1; // Mask: 0x1, PropSize: 0x10x8B8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanHitBallisticTestsOnlyTestIndesructiblesWhileFalling : 1; // Mask: 0x2, PropSize: 0x10x8B8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1F : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1BA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               FireOffset;                                        // 0x8BC(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationNoiseRange;                              // 0x8C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ImpactNoiseRange;                                  // 0x8CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationNoiseLoudness;                           // 0x8D0(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ImpactNoiseLoudness;                               // 0x8D4(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 ProhibitedTargetTags;                              // 0x8D8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BB[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bLeadPawnTargets;                                  // 0x8F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BC[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DesiredThrowAngle;                                 // 0x8FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxYawAngleToFire;                                 // 0x900(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bClampMaxYawAngleToFire;                           // 0x904(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseTargetActorLocation;                           // 0x905(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BD[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InitialAccuracyMax;                                // 0x908(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InitialAccuracyMin;                                // 0x90C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetAccuracyMax;                                 // 0x910(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetAccuracyMin;                                 // 0x914(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinAccuracyDistance;                               // 0x918(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAccuracyDistance;                               // 0x91C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AccuracyDistanceMultiplier;                        // 0x920(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumUsesToReachTargetAccuracy;                      // 0x924(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UseCount;                                          // 0x928(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortGameplayAbilityBehaviorDistanceData> GameplayAbilityBehaviorDistanceData;               // 0x930(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BF[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortGameplayAbilityMontageInfo       MontageInfo;                                       // 0x960(0x60)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  DisplayName;                                       // 0x9C0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x9D8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            SmallPreviewImageOverride;                         // 0x9F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortTooltip>              Tooltip;                                           // 0xA08(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortTooltipDisplayStatsList*          StatList;                                          // 0xA10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C2[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortGameplayAbility* GetDefaultObj();

	bool SetupPreviewImageOverride();
	void SetAIFocalPoint(class AActor* FocusTarget, const struct FVector& FocalPoint, bool bUseAttackingPriority);
	void QueryGameplayEffectContainerTargetExecutionModifiers(const struct FGameplayAbilityTargetDataHandle& TargetData, class UFortAbilitySystemComponent* SrcAbilitySystem, const struct FGameplayTag& ApplicationTag, int32 GameplayEffectLevel, class UObject* SourceObject, TArray<struct FGameplayEffectExecutionScopedModifierInfo>& InScopedMods, const TArray<struct FActiveGameplayEffectHandle>& InIgnoreHandles, TArray<struct FGameplayModifierEvaluatedData>* OutOutputModifiers);
	void OnAbilityInputReleased();
	struct FFortGameplayEffectContainerSpec MakeGameplayEffectContainerSpec(const struct FGameplayTag& ApplicationTag, int32 GameplayEffectLevel);
	void K2_TriggerFromAnimation(const struct FGameplayTag& ApplicationTag);
	bool K2_ShouldUseDecoTool(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_AbilityCompleted();
	bool IsTargetOutsideOfMaxYawRotation();
	TSubclassOf<class UFortTooltip> GetTooltip();
	void GetProjectileInitialValues(float* OutProjectileSpeed, struct FRotator* OutSpawnDirection, float* OutProjectileGravity, class AActor** HomingTarget, bool bApplyInaccuracy, bool bApplyClampedMaxYawAngleToFire, bool bApplyLeading);
	struct FRotator GetFireRotation(bool bApplyLeading, bool bApplyInaccuracy, bool bApplyClampedMaxYawAngleToFire);
	struct FVector GetFireLocation();
	class UFortTooltipDisplayStatsList* GetDisplayStats();
	struct FTransform GetCustomAbilitySourceTransform();
	class AFortWeapon* GetCurrentSourceWeapon();
	class UFortWorldItemDefinition* GetCurrentSourceItemDefinition();
	void GetCurrentAbilitySourceLevel(float* OutSourceLevel);
	struct FVector GetAimLocationNearestPawn(class AFortPawn* Instigator);
	class AActor* GetAIAbilityTarget();
	class AFortPawn* GetActivatingPawn();
	class UFortAbilitySystemComponent* GetActivatingAbilityComponent();
	void EquipAbilityWeapon(class UFortWeaponItemDefinition* WeaponDefinition, int32 ItemLevel);
	bool DoesTargetHaveTags(class AActor* Target, struct FGameplayTagContainer& Tags);
	bool DoesTargetHaveProhibitedTagsForAI(class AActor* Target);
	void ClearAIFocalPoint(bool bUseAttackingPriority);
	void CalculateProjectileTrajectorySpline(TArray<struct FVector>* OutSplinePoints, TArray<struct FVector>* OutSplineTangents, class AActor* Instigator, const struct FVector& InitialLocation, const struct FVector& InitialVelocity, float Gravity, float Friction, float Bounciness, float TimeStep, float TraceExtent);
	struct FFortGameplayEffectContainer BP_GetGameplayEffectContainer(const struct FGameplayTag& ApplicationTag);
	TArray<struct FActiveGameplayEffectHandle> ApplyGameplayEffectContainer(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag, int32 GameplayEffectLevel);
	struct FVector ApplyAccuracyToTargetLocation(struct FVector& SourceLocation, struct FVector& TargetLocation, float InDesiredThrowAngle);
};

// 0x138 (0x978 - 0x840)
// Class FortniteGame.StrategicBuildingActor
class AStrategicBuildingActor : public ABuildingGameplayActor
{
public:
	float                                        HealthBarVisibilityDistance;                       // 0x840(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HealthBarVisibilityDistanceSquared;                // 0x844(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         TouchBoxComponent;                                 // 0x848(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortStrategicBuildingCategory    StrategicBuildingCategory;                         // 0x850(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortAbilitySet*>               PermanentInherentAbilitySets;                      // 0x858(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FStrategicBuildingLevelInformation> LevelInfo;                                         // 0x868(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        ProximityPulseInterval;                            // 0x878(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortGameplayAbility>      DeathPenaltyAbility;                               // 0x880(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       DeathParticles;                                    // 0x888(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                            DeathSound;                                        // 0x890(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGadgetItemDefinition*             SpawnedFromItemDefinition;                         // 0x898(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTeamStrategicBuildingHandle          SBAHandle;                                         // 0x8A0(0x4)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FStrategicBuildingActiveConstructionInfo ConstructionProgress;                              // 0x8A4(0x10)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStrategicBuildingLevelActiveCriteriaProgress> LevelProgress;                                     // 0x8B8(0x10)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAbilitySetHandle>         StrategicBuildingAbilitySets;                      // 0x8C8(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAbilitySetHandle>         PersistentlyAppliedAbilitySets;                    // 0x8D8(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        DeferredTouchActorsToProcess;                      // 0x8E8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C8[0x58];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsActive : 1;                                     // Mask: 0x1, PropSize: 0x10x950(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasGEsToApplyOnTouch : 1;                         // Mask: 0x2, PropSize: 0x10x950(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasGEsToApplyOnPulseTimer : 1;                    // Mask: 0x4, PropSize: 0x10x950(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_20 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1C9[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortVisibilityComponent*              VisibilityComponent;                               // 0x958(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                            MiniMapIcon;                                       // 0x960(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CA[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AStrategicBuildingActor* GetDefaultObj();

	void SetupVisibilityComponent();
	void SetupIndicators();
	void ProcessDeferredTouchActors();
	void OnRep_ConstructionProgress();
	void OnRep_bIsActive();
	void OnConstructionTickPlayEffects(float DeltaTime, float ElapsedPct, int32 ConstructionLvl);
	void OnConstructionStartedPlayEffects(float ServerStartTime, float ServerEndTime, float CurrentServerTime, float ElapsedPct, int32 ConstructionLvl);
	void OnConstructionEndedPlayEffects(int32 ConstructionLevel);
	void OnActiveStatusChanged(bool bNewActiveStatus);
	bool IsActive();
	void GiveItemFromStrategicBuildingToPlayer(class AFortPlayerController* PlayerController, class UFortWorldItemDefinition* ItemDefinition, int32 NumberToGive);
	float GetMaxLevelUnlockProgress(int32 InLevel);
	struct FVector GetDeathEffectsScale();
	struct FRotator GetDeathEffectsRotation();
	struct FVector GetDeathEffectsLocation();
	float GetCurrentLevelUnlockProgress(int32 InLevel);
	bool AttemptIncrementLevelUnlockProgress(int32 InLevel, float InProgressDelta);
	void ApplyProximityPulseEffects();
};

// 0x38 (0x9B0 - 0x978)
// Class FortniteGame.FortPvPBaseCornerstone
class AFortPvPBaseCornerstone : public AStrategicBuildingActor
{
public:
	uint8                                        bInvincible : 1;                                   // Mask: 0x1, PropSize: 0x10x978(0x1)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_21 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1CB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnCornerstoneDamaged;                              // 0x980(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnCornerstoneOutOfHealth;                          // 0x990(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CC[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortPvPBaseCornerstone* GetDefaultObj();

	void SetInvincibility(bool bInInvincible);
	void OnRep_bInvincible();
	void OnInvincibilityChanged(bool bIsInvincible);
};

// 0xA0 (0x7D8 - 0x738)
// Class FortniteGame.BuildingRift
class ABuildingRift : public ABuildingActor
{
public:
	float                                        DistToTarget;                                      // 0x738(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnDelay;                                        // 0x740(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UEnvQuery*                             EnvironmentQuery;                                  // 0x748(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FEnvNamedValue>                QueryParams;                                       // 0x750(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        QueryRadius;                                       // 0x760(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CF[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       FreeSpawnSlots;                                    // 0x768(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortSpawnSlotData>            UsedSpawnSlots;                                    // 0x778(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D0[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bRiftIsVisible;                                    // 0x798(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRiftIsActive;                                     // 0x799(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsReadyToSpawnAI;                                 // 0x79A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasBadRiftSlots;                                  // 0x79B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D1[0x3C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingRift* GetDefaultObj();

	void OnStartedEncounterSpawn(class AFortAIPawn* SpawnedAI);
	void OnSpawnAI();
	void OnRep_RiftIsVisible();
	void OnRep_RiftIsActive();
	void OnRemoved();
	void OnPlaced();
	void OnFinishedEncounterSpawn(class AFortAIPawn* SpawnedAI);
	void OnDeactivated();
	void OnActivated();
	void BroadcastRiftSpawningAI();
};

// 0x28 (0x800 - 0x7D8)
// Class FortniteGame.FortTakerRift
class AFortTakerRift : public ABuildingRift
{
public:
	TSoftObjectPtr<class UParticleSystem>        TakerRiftParticle;                                 // 0x7D8(0x20)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*              TakerRiftParticleComponent;                        // 0x7F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AFortTakerRift* GetDefaultObj();

};

// 0x8 (0xFC8 - 0xFC0)
// Class FortniteGame.BuildingAutoNav
class ABuildingAutoNav : public ABuildingSMActor
{
public:
	uint8                                        bAutoAssignNavProperties : 1;                      // Mask: 0x1, PropSize: 0x10xFC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D2[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingAutoNav* GetDefaultObj();

};

// 0x104 (0x10CC - 0xFC8)
// Class FortniteGame.BuildingContainer
class ABuildingContainer : public ABuildingAutoNav
{
public:
	class USoundCue*                             SearchingSoundCueLoop;                             // 0xFC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             LootRepeatSoundCue;                                // 0xFD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             OnDamageSoundCue;                                  // 0xFD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             OnDeathSoundCue;                                   // 0xFE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           SearchedMesh;                                      // 0xFE8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>            SearchedMaterialOverrides;                         // 0xFF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	float                                        SearchBounceRadiusOverride;                        // 0x1000(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SearchLootTierGroup;                               // 0x1008(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FChosenQuotaInfo                      SearchLootTierChosenQuotaInfo;                     // 0x1010(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                  ContainerLootTierKey;                              // 0x1020(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ReplicatedLootTier;                                // 0x1028(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             NumItemsToDropRange;                               // 0x102C(0x8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortWorldItemDefinition*              LootTestingData;                                   // 0x1038(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LootNoiseRange;                                    // 0x1040(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LootNoiseLoudness;                                 // 0x1044(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LootSpawnLocation;                                 // 0x1048(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LootFinalLocation;                                 // 0x1054(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LootTossDirection_Athena;                          // 0x1060(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LootTossSpeed_Athena;                              // 0x106C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LootTossConeHalfAngle_Athena;                      // 0x1070(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortRarity                       HighestRarity;                                     // 0x1074(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D5[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bAlwaysShowContainer : 1;                          // Mask: 0x1, PropSize: 0x10x1078(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysMaintainLoot : 1;                           // Mask: 0x2, PropSize: 0x10x1078(0x1)(Edit, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDestroyContainerOnSearch : 1;                     // Mask: 0x4, PropSize: 0x10x1078(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlreadySearched : 1;                              // Mask: 0x8, PropSize: 0x10x1078(0x1)(BlueprintVisible, Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBuriedTreasure : 1;                               // Mask: 0x10, PropSize: 0x10x1078(0x1)(Edit, BlueprintVisible, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasRaisedTreasure : 1;                            // Mask: 0x20, PropSize: 0x10x1078(0x1)(Edit, BlueprintVisible, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartAlreadySearched_Athena : 1;                  // Mask: 0x40, PropSize: 0x10x1078(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegenerateLoot : 1;                               // Mask: 0x80, PropSize: 0x10x1078(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LootedWeaponsDurabilityModifier;                   // 0x107C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeUntilLootRegenerates;                          // 0x1080(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSearchBounceData                 SearchBounceData;                                  // 0x1084(0x10)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bUseLocationForDrop;                               // 0x1094(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D7[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCurveTableRowHandle                  SearchSpeed;                                       // 0x1098(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D8[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CurrentInteractBounceCurve;                        // 0x10B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           CurrentInteractBounceNormalCurve;                  // 0x10C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1D9[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingContainer* GetDefaultObj();

	void RaiseTreasure();
	void OnSetSearched();
	void OnSearchInterrupted();
	void OnRep_bAlreadySearched();
	void OnRaiseTreasure();
	void OnLootReset();
	void OnLootRepeat();
	void OnLoot();
	void OnBeginSearch();
	int32 GetLootTier();
	void BounceContainer();
};

// 0x74 (0x1140 - 0x10CC)
// Class FortniteGame.KeepItemContainer
class AKeepItemContainer : public ABuildingContainer
{
public:
	int32                                        HostUpgradeLevel;                                  // 0x10CC(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AFortPlayerState>> SearchedBy;                                        // 0x10D0(0x10)(Net, ZeroConstructor, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	enum class EKeepContainerType                ContainerType;                                     // 0x10E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseDefaultLootLogic;                              // 0x10E1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResetThisWhenKeepResets;                          // 0x10E2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DA[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ContainerNameKey;                                  // 0x10E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            ContainerDataTable;                                // 0x10F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowChoiceUI;                                     // 0x10F8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EFortItemType>             ItemsInChoiceUI;                                   // 0x1100(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DC[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortRarity                       BestAvailableRarity;                               // 0x1120(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DD[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxItems;                                          // 0x1124(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DE[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AKeepItemContainer* GetDefaultObj();

	void RestoreLoot();
	void ResetContainer(class AFortPlayerController* FortPC);
	void OnRep_SearchedBy();
	void OnRep_HostUpgradeLevel();
	void InitializeContainer(int32 InitUpgradeLevel);
	int32 GetLootTierOverride();
	class FName GetContainerNameAndLevelKey();
};

// 0x0 (0x1140 - 0x1140)
// Class FortniteGame.KeepItemCoreContainer
class AKeepItemCoreContainer : public AKeepItemContainer
{
public:

	static class UClass* StaticClass();
	static class AKeepItemCoreContainer* GetDefaultObj();

};

// 0x18 (0xFE0 - 0xFC8)
// Class FortniteGame.BuildingCorner
class ABuildingCorner : public ABuildingAutoNav
{
public:
	class ABuildingSMActor*                      PrimaryWall;                                       // 0xFC8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingSMActor*                      SecondaryWall;                                     // 0xFD0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DF[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingCorner* GetDefaultObj();

};

// 0x0 (0xFE0 - 0xFE0)
// Class FortniteGame.BuildingPropCorner
class ABuildingPropCorner : public ABuildingCorner
{
public:

	static class UClass* StaticClass();
	static class ABuildingPropCorner* GetDefaultObj();

};

// 0x8 (0xFD0 - 0xFC8)
// Class FortniteGame.BuildingDeco
class ABuildingDeco : public ABuildingAutoNav
{
public:
	bool                                         bCastShadow;                                       // 0xFC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E0[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingDeco* GetDefaultObj();

};

// 0x8 (0xFD0 - 0xFC8)
// Class FortniteGame.BuildingPillar
class ABuildingPillar : public ABuildingAutoNav
{
public:
	uint8                                        Pad_1E1[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingPillar* GetDefaultObj();

};

// 0x0 (0xFC8 - 0xFC8)
// Class FortniteGame.BuildingProp
class ABuildingProp : public ABuildingAutoNav
{
public:

	static class UClass* StaticClass();
	static class ABuildingProp* GetDefaultObj();

};

// 0x148 (0x1110 - 0xFC8)
// Class FortniteGame.BuildingPropAtlas
class ABuildingPropAtlas : public ABuildingProp
{
public:
	class UPrimitiveComponent*                   Ring1Comp;                                         // 0xFC8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   Ring2Comp;                                         // 0xFD0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   Ring3Comp;                                         // 0xFD8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              RingTransitionMID;                                 // 0xFE0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                       PortalAudioComp;                                   // 0xFE8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E3[0x120];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingPropAtlas* GetDefaultObj();

	void StopRingSpinning();
	void SetupAnimationTransition(class UMaterialInstanceDynamic* Mid, class FName ParamName, float InTransitionTime);
	void SetupAnimationSpeed(float InActivationTime, float InTotalDefenseTime, float InAnimSpeedStart, float InAnimSpeedEnd);
	void RestoreRingsHierarchy();
	void PlayRingsReset(float AnimDuration);
	void PlayRingSpinning(struct FRotator& Ring1RateMin, struct FRotator& Ring1RateMax, struct FRotator& Ring2Rate, struct FRotator& Ring3Rate);
	void PlayRingsIdleLoop(float AnimDuration, float Ring1ZOffset);
	void PlayRingDamage(float DurationMin, float DurationMax, float MagnitudeMin, float MagnitudeMax);
	void OnRingSpinningLoop();
	void InitializeRings(class UPrimitiveComponent* InRing1Comp, class UPrimitiveComponent* InRing2Comp, class UPrimitiveComponent* InRing3Comp);
	void InitializeAudio(class UAudioComponent* InPortalLoopingComp);
	float GetDefenseProgress();
	float GetDefenseAnimSpeed();
};

// 0x18 (0xFE0 - 0xFC8)
// Class FortniteGame.BuildingPropWall
class ABuildingPropWall : public ABuildingProp
{
public:
	struct FBuildingActorNavArea                 AreaPatternOverride;                               // 0xFC8(0x4)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	enum class EBuildingWallArea                 AreaShapeType;                                     // 0xFCC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E4[0x13];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingPropWall* GetDefaultObj();

};

// 0x50 (0x270 - 0x220)
// Class FortniteGame.FortAccountItemDefinition
class UFortAccountItemDefinition : public UFortItemDefinition
{
public:
	struct FCurveTableRowHandle                  LevelToXpHandle;                                   // 0x220(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  LevelToSacrificeXpHandle;                          // 0x230(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SacrificeRecipe;                                   // 0x240(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   TransmogSacrificeRow;                              // 0x250(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>           ConversionRecipes;                                 // 0x260(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAccountItemDefinition* GetDefaultObj();

	TArray<struct FFortItemQuantityPair> GetRecyclingRefunds();
};

// 0x940 (0xBB0 - 0x270)
// Class FortniteGame.FortAlterationItemDefinition
class UFortAlterationItemDefinition : public UFortAccountItemDefinition
{
public:
	enum class EFortAlteration                   AlterationType;                                    // 0x270(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1E5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortCosmeticModification             DefaultCosmetic;                                   // 0x278(0x8F8)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FFortConditionalCosmeticModification> ConditionalCosmetics;                              // 0xB70(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFortConditionalIncludeTags>   AdditionalGameplayTags;                            // 0xB80(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortAbilitySet>        AlterationAbilitySet;                              // 0xB90(0x20)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAlterationItemDefinition* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.FortAlterationFunctionLibrary
class UFortAlterationFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFortAlterationFunctionLibrary* GetDefaultObj();

	class UParticleSystem* GetAlterationImpactPhysicalSurfaceEffects(enum class EPhysicalSurface HitSurface, struct FFortCosmeticModification& CosmeticMod);
};

// 0x208 (0x628 - 0x420)
// Class FortniteGame.FortWeaponItemDefinition
class UFortWeaponItemDefinition : public UFortWorldItemDefinition
{
public:
	TSoftClassPtr<class AFortWeapon>             WeaponActorClass;                                  // 0x420(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USkeletalMesh>          WeaponMeshOverride;                                // 0x440(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   WeaponStatHandle;                                  // 0x460(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortAlterationItemDefinition> BaseAlteration;                                    // 0x470(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortAlterationItemDefinition> BaseCosmeticAlteration;                            // 0x490(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortGameplayAbility>    PrimaryFireAbility;                                // 0x4B0(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortGameplayAbility>    SecondaryFireAbility;                              // 0x4D0(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortGameplayAbility>    ReloadAbility;                                     // 0x4F0(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftClassPtr<class UFortGameplayAbility>> EquippedAbilities;                                 // 0x510(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortWorldItemDefinition> AmmoData;                                          // 0x520(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LowAmmoPercentage;                                 // 0x540(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DegradedPercentage;                                // 0x544(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortWeaponTriggerType            TriggerType;                                       // 0x548(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowTargetingDuringReload;                       // 0x549(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             ReticleImage;                                      // 0x550(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<float>                                ReticleCornerAngles;                               // 0x570(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             HitNotifyImage;                                    // 0x580(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             MuzzleBlockedImage;                                // 0x5A0(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<float>                                HitNotifyCornerAngles;                             // 0x5C0(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             ReticleCenterImage;                                // 0x5D0(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             ReticleCenterImageOffset;                          // 0x5F0(0x8)(Edit, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bReticleCornerOutsideSpreadRadius;                 // 0x5F8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EB[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HitNotifyDuration;                                 // 0x5FC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UCurveFloat>            HitNotifyOpacityCurve;                             // 0x600(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bValidForLastEquipped;                             // 0x620(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortDisplayTier                  DisplayTier;                                       // 0x621(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EC[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortWeaponItemDefinition* GetDefaultObj();

	bool ShouldAllowTargetingDuringReload();
	struct FDataTableRowHandle GetWeaponStatHandle();
	class USkeletalMesh* GetWeaponMeshOverride();
	TSubclassOf<class AFortWeapon> GetWeaponActorClass();
	enum class EFortWeaponTriggerType GetTriggerType();
	class FText GetShortDisplayName();
	TSubclassOf<class UFortGameplayAbility> GetSecondaryFireAbility();
	class UTexture2D* GetReticleImage();
	TArray<float> GetReticleCornerAngles();
	struct FVector2D GetReticleCenterImageOffset();
	class UTexture2D* GetReticleCenterImage();
	TSubclassOf<class UFortGameplayAbility> GetReloadAbility();
	TSubclassOf<class UFortGameplayAbility> GetPrimaryFireAbility();
	class UTexture2D* GetMuzzleBlockedImage();
	float GetLowAmmoPercentage();
	class UCurveFloat* GetHitNotifyOpacityCurve();
	class UTexture2D* GetHitNotifyImage();
	float GetHitNotifyDuration();
	TArray<TSubclassOf<class UFortGameplayAbility>> GetEquippedAbilities();
	class FText GetDisplayTierAsText(enum class EFortDisplayTier DisplayTier);
	enum class EFortDisplayTier GetDisplayTier();
	float GetDegradedPercentage();
	class UFortAlterationItemDefinition* GetBaseCosmeticAlteration();
	class UFortAlterationItemDefinition* GetBaseAlteration();
};

// 0x398 (0x1360 - 0xFC8)
// Class FortniteGame.FortConstructorBASE
class AFortConstructorBASE : public ABuildingProp
{
public:
	uint8                                        Pad_1FC[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FBASEGameplayEffect>           BASEBuildingApplicationEffects;                    // 0xFD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FBASEGameplayEffect>           BASEFriendlyApplicationEffects;                    // 0xFE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FBASEGameplayEffect>           BASEFriendlyApplicationTrapEffects;                // 0xFF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FBASEGameplayEffect>           BASEEnemyApplicationEffects;                       // 0x1000(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InBASETag;                                         // 0x1010(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NodesToAffect;                                     // 0x1018(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BaseLevel;                                         // 0x101C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPatternBASEEffect>            BASEEffectPatterns;                                // 0x1020(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortBaseWeaponStats                  DamageStats;                                       // 0x1030(0x120)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UFortDamageSet*                        DamageAttributeSet;                                // 0x1150(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FF[0x208];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortConstructorBASE* GetDefaultObj();

	void StopBuildingActorVisuals(class ABuildingSMActor* BuildingActor, class UStaticMeshComponent* EffectMeshComp);
	void StartBuildingActorVisuals(class ABuildingSMActor* BuildingActor, class UStaticMeshComponent* EffectMeshComp);
	void OnPlaced(class UAbilitySystemComponent* InstigatorAbilitySystemComponent);
	void OnPawnRemovedFromBase(class AFortPawn* Pawn);
	void OnPawnAddedToBase(class AFortPawn* Pawn);
	void OnBasePawnDied(class AFortPawn* Pawn);
	void OnBasePawnDestroyed(class AFortPawn* Pawn);
	void OnBaseCollisionUnTouched(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnBaseCollisionTouched(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	TArray<class ABuildingSMActor*> GetBuildingActorsInBase();
};

// 0x8 (0xFD0 - 0xFC8)
// Class FortniteGame.FortOutpostBuilding
class AFortOutpostBuilding : public ABuildingProp
{
public:
	uint8                                        Pad_200[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AFortOutpostBuilding* GetDefaultObj();

};

// 0x198 (0x1160 - 0xFC8)
// Class FortniteGame.FortTrack
class AFortTrack : public ABuildingProp
{
public:
	UMulticastDelegateProperty_                  OnTrackGraphChanged;                               // 0xFC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FText                                  ToggleSwitchText;                                  // 0xFD8(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        ToggleInteractTime;                                // 0xFF0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_212[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           TrackPieceMeshesByType[0x5];                       // 0xFF8(0x28)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseFloorMesh;                                     // 0x1020(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_213[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           TrackFloorMeshesByVerticality[0x3];                // 0x1028(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTrackConnectorMeshConfig>     ConnectorMeshConfigs;                              // 0x1040(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class AFortTrack*                            NeighborsByDirection[0x4];                         // 0x1050(0x20)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
